Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.Types.BaseUncertainty
source: Maximum possible value (lower <= value <= upper)
de: Größtmöglicher Wert (lower <= value <= upper)

# Credibility.Types.BaseUncertainty
source: <html> <p> A&nbsp;common uncertainty setup for a&nbsp;<em>scalar real parameter</em>. Besides <em>source</em>, <em>info</em> and <em>reference</em>, detailed in <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a>, inherent limits of a&nbsp;physical quantity (i.e., upper and lower limits of a&nbsp;scalar value) are defined here, independent of the kind of the mathematical description of the uncertainty. A&nbsp;particular mathematical description is, then, provided with the derived uncertainty types, see e.g. <a href="modelica://Credibility.Types.Interval">Interval</a> or <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a>. </p> </html>
de: <html> <p> Eine allgemeine Unsicherheitseinstellung für einen <em>skalaren reelen Parameter</em>. Neben der <em>Quelle (source)</em>, der <em>Information (info)</em> und der <em>Referenz (reference)</em>, näher beschrieben im <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a>, sind hier auch die inhärenten Grenzen einer physikalischen Größe (d.h. Ober- und Untergrenzen eines skalaren Wertes) definiert, unabhängig von der Art der mathematischen Beschreibung der Unsicherheit. Eine konkrete mathematische Beschreibung wird dann mit den abgeleiteten Unsicherheitstypen bestimmt, siehe z.B. <a href="modelica://Credibility.Types.Interval">Interval</a> oder <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a>. </p> </html>

# Credibility.Types.Interval
source: Uncertainty defined by interval (epistemic uncertainty)
de: Unsicherheit definiert durch ein Intervall (erkenntnistheoretische Unsicherheit)

# Credibility.Types.Interval
source: <html> <p> An <em>epistemic</em> uncertainty, i.e. the uncertainty <em>due to lack of knowledge</em> &ndash; e.g., on the side of model, analysis or experiment. The uncertainty is described only by the <em>minimum</em> and the <em>maximum</em> possible value of the uncertain scalar. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> The <em>parameter value</em> is here considered being equal to the <em>nominal value</em> which is used in an optimization run that determines improved control parameters or the nominal value used during a&nbsp;Monte Carlo simulation to propagate uncertainties to output variables. </p> </html>
de: <html> <p> Eine <em>erkenntnistheoretische (epistemische)</em> Unsicherheit, d.h. die Unsicherheit <em>auf Grund von fehlendem Wissen</em> &ndash; z.B. seitens des Modells, der Analyse oder des Experiments. Die Unsicherheit wird nur durch den <em>kleinst-</em> und den <em>größtmöglichen</em> Wert des unsicheren Skalars beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Der <em>Parameterwert</em> wird hier dem <em>Sollwert (nominal value)</em> gleichgesetzt, der in einem Optimierungslauf verwendet wird, um den verbesserten Steuerungsparameter oder den Sollwert zu bestimmen, der während einer Monte-Carlo-Simulation zum Übertragen der Unsicherheiten auf Ausgangsvariablen verwendet wird. </p> </html>

# Credibility.Types.IntervalTolerance
source: Uncertainty defined by interval (epistemic uncertainty) with tolerance
de: Unsicherheit definiert durch ein Intervall (erkenntnistheoretische Unsicherheit) mit Toleranz

# Credibility.Types.IntervalTolerance
source: Nominal value
de: Sollwert

# Credibility.Types.IntervalTolerance
source: Limits: |value - nominal| <= max(absTol, relTol*|nominal|)
de: Grenzwerte: |value - nominal| <= max(absTol, relTol*|nominal|)

# Credibility.Types.IntervalTolerance
source: <html> <p> An <em>epistemic</em> uncertainty, i.e. the uncertainty <em>due to lack of knowledge</em> &ndash; e.g., on the side of model, analysis or experiment. The uncertainty is described by a&nbsp;<em>nominal value</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> Often, it is inconvenient to provide absolute ranges of a&nbsp;value and, instead, relative or absolute deviations are more practical. In the eFMI standard (<a href="https://emphysis.github.io/pages/downloads/efmi_specification_1.0.0-alpha.4.zip">Functional Mock-up Interface for embedded systems</a>), for example, tolerances for reference results are defined in a&nbsp;similar way as tolerances for numerical integration algorithms. Due to its generality, this description form of eFMI is used here as well: </p> <ul> <li> <em>nominal</em>: nominal value of the scalar. Typically, the nominal value is used as default for the actual parameter value. </li> <li> <em>relTol</em>: relative tolerance of limits with respect to nominal (default&nbsp;=&nbsp;0.0). </li> <li> <em>absTol</em>: absolute tolerance of limits with respect to nominal (default&nbsp;=&nbsp;0.0). </li> </ul> <p> Utilizing this information, the lower and upper values of the underlaid <a href="modelica://Credibility.Types.Interval">interval distribution</a> can be computed in the following way: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|), lower = nominal &minus; tol, upper = nominal + tol. </pre></blockquote> <p> For example, the parameter&nbsp;<var>R</var> of a&nbsp;resistor has the nominal value of 200&nbsp;&ohm;, the minimum possible value of 190&nbsp;&ohm; and the maximum possible value 210&nbsp;&ohm;. Then, the following tolerances can be provided: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;% &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (and <code>absTol&nbsp;= 0</code>) or </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm; &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (and <code>relTol&nbsp;= 0</code>). </li> </ul> <p> Typically, either a&nbsp;description with relTol or with absTol is used, but not a&nbsp;combination of both. On the contrary, there is an important use case where the description with both relTol and absTol is useful: If reference results are provided (e.g. the results of a&nbsp;simulation or an experiment are required to be within some band around a&nbsp;provided reference solution) then a&nbsp;definition with relTol is often practical together with absTol as band for small values of the reference around zero, where relTol makes no sense. </p> </html>
de: <html> <p> Eine <em>erkenntnistheoretische (epistemische)</em> Unsicherheit, d.h. die Unsicherheit <em>auf Grund von fehlendem Wissen</em>, z.B. auf der Seite des Modells, der Analyse oder des Experiments. Die Unsicherheit wird durch einen <em>Nominalwert</em> und ein <em>Intervall</em> beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Oft ist es umständlich, absolute Gültigkeitsbereiche eines Wertes anzugeben. Stattdessen sind relative oder absolute Abweichungen praktischer. Zum Beispiel werden im eFMI-Standard (<a href="https://emphysis.github.io/pages/downloads/efmi_specification_1.0.0-alpha.4.zip">Functional Mock-up Interface für eingebettete Systeme</a>) Toleranzen für Referenzergebnisse auf ähnliche Weise definiert wie Toleranzen für numerische Integrationsalgorithmen. Aufgrund seiner Allgemeinheit wird diese Beschreibungsform von eFMI auch hier verwendet: </p> <ul> <li> <em>nominal</em>: Nominalwert vom Skalar. Typischerweise wird der Nominalwert als Vorgabe für den eigentlichen Parameterwert verwendet. </li> <li> <em>relTol</em>: relative Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0). </li> <li> <em>absTol</em>: absolute Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0). </li> </ul> <p> Mit Hilfe dieser Information können die Unter- und die Obergrenze der unterlegten <a href="modelica://Credibility.Types.Interval">Intervallverteilung</a> wie folgt berechnet werden: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|), lower = nominal &minus; tol, upper = nominal + tol. </pre></blockquote> <p> Zum Beispiel hat der Parameter&nbsp;<var>R</var> eines elektrischen Widerstands den Nominalwert von 200&nbsp;&ohm;, den kleinstmöglichen Wert 190&nbsp;&ohm; und den größtmöglichen Wert 210&nbsp;&ohm;. Dann können folgende Toleranzen bestimmt werden: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;% &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (und <code>absTol&nbsp;= 0</code>) oder </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm; &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (und <code>relTol&nbsp;= 0</code>). </li> </ul> <p> Normalerweise wird entweder eine Beschreibung mit relTol oder mit absTol verwendet, aber nicht eine Kombination aus beiden. Jedoch gibt es einen wichtigen Anwendungsfall, in dem die Beschreibung sowohl mit relTol als auch mit absTol nützlich ist: Wenn Referenzergebnisse zur Verfügung gestellt werden (z.B. die Ergebnisse einer Simulation oder eines Experiments müssen innerhalb einer Bandbreite um eine zur Verfügung gestellte Referenzlösung liegen), dann ist eine Definition mit relTol zusammen mit absTol als Bandbreite für kleine Referenzwerte um Null herum oft praktisch, weil relTol hier keinen Sinn macht. </p> </html>

# Credibility.Types.Uniform
source: Uncertainty defined by uniform distribution
de: Unsicherheit definiert durch Gleichverteilung

# Credibility.Types.Uniform
source: <html> <p> An uncertainty describing possible value of the uncertain scalar by a&nbsp;<em>uniform distribution</em>, i.e. the probability of value outcome is equal between the <em>minimum</em> and the <em>maximum</em> limits. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> The <em>parameter value</em> is here considered being equal to the <em>nominal value</em> which is used in an optimization run that determines improved control parameters or the nominal value used during a&nbsp;Monte Carlo simulation to propagate uncertainties to output variables. </p> <p> The Modelica Standard Library provides <a href="modelica://Modelica.Math.Distributions.Uniform">Modelica.Math.Distributions.Uniform</a>. For more details of the uniform distribution, see Wikipedia &ndash; <a href="https://en.wikipedia.org/wiki/Continuous_uniform_distribution">continuous uniform distribution</a>. </p> </html>
de: <html> <p> Eine Unsicherheit, die den möglichen Wert des unsicheren Skalars durch eine <em>Gleichverteilung</em> beschreibt, d.h. die Wahrscheinlichkeit des Wertergebnisses ist zwischen der <em>Unter-</em> und der <em>Obergrenze</em> gleich. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Der <em>Parameterwert</em> wird hier als <em>Sollwert</em> betrachtet, der in einem Optimierungslauf verwendet wird, der verbesserte Reglerparameter ermittelt, oder dem Sollwert, der während einer Monte Carlo-Simulation verwendet wird, um Unsicherheiten auf Ausgangsvariablen zu übertragen. </p> <p> In der Modelica-Standardbibliothek steht <a href="modelica://Modelica.Math.Distributions.Uniform">Modelica.Math.Distributions.Uniform</a>. zur Verfügung. Für weitere Einzelheiten der Gleichverteilung siehe Wikipedia &ndash; <a href="https://en.wikipedia.org/wiki/Continuous_uniform_distribution">continuous uniform distribution</a>. </p> </html>

# Credibility.Types.UniformTolerance
source: Uncertainty defined by uniform distribution with tolerance
de: Unsicherheit definiert durch Gleichverteilung mit Toleranz

# Credibility.Types.UniformTolerance
source: Nominal value
de: Sollwert

# Credibility.Types.UniformTolerance
source: Limits: |value - nominal| <= max(absTol,relTol*|nominal|)
de: Grenzwerte: |value - nominal| <= max(absTol,relTol*|nominal|)

# Credibility.Types.UniformTolerance
source: <html> <p> An uncertainty describing possible value of the uncertain scalar by a&nbsp;<em>uniform distribution</em>, i.e. the probability of value outcome is equal between the limits which are given by a&nbsp;<em>nominal value</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> Similarly to <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a>, this description utilizes: </p> <ul> <li> <em>nominal</em>: nominal value of the scalar. Typically, the nominal value is used as default for the actual parameter value. </li> <li> <em>relTol</em>: relative tolerance of limits with respect to nominal (default&nbsp;=&nbsp;0.0). </li> <li> <em>absTol</em>: absolute tolerance of limits with respect to nominal (default&nbsp;=&nbsp;0.0). </li> </ul> <p> Utilizing this information, the lower and upper values of the underlaid <a href="modelica://Credibility.Types.Uniform">uniform distribution</a> can be computed in the following way: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|), lower = nominal &minus; tol, upper = nominal + tol. </pre></blockquote> </html>
de: <html> <p> Eine Unsicherheit, die den möglichen Wert des unsicheren Skalars durch eine <em>Gleichverteilung</em> beschreibt, d.h. die Wahrscheinlichkeit des Wertergebnisses ist zwischen der Grenzwerten, die durch einen <em>Nominalwert</em> und ein <em>Interval</em> gegeben sind, gleich. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Ähnlich zu <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a> verwendet diese Beschreibung: </p> <ul> <li> <em>nominal</em>: Nominalwert vom Skalar. Typischerweise wird der Nominalwert als Vorgabe für den eigentlichen Parameterwert verwendet. </li> <li> <em>relTol</em>: relative Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0). </li> <li> <em>absTol</em>: absolute Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0). </li> </ul> <p> Mit Hilfe dieser Information können die Unter- und die Obergrenze der unterlegten <a href="modelica://Credibility.Types.Uniform">Gleichverteilung</a> wie folgt berechnet werden: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|), lower = nominal &minus; tol, upper = nominal + tol. </pre></blockquote> </html>

# Credibility.Types.TruncatedNormal
source: Uncertainty defined by truncated normal distribution
de: Unsicherheit definiert als abgeschnittene Normalverteilung

# Credibility.Types.TruncatedNormal
source: Mean of (non-truncated) normal distribution
de: Mittelwert der (nicht abgeschnittenen) Normalverteilung

# Credibility.Types.TruncatedNormal
source: Standard deviation of (non-truncated) normal distribution
de: Standardabweichung der (nicht abgeschnittenen) Normalverteilung

# Credibility.Types.TruncatedNormal
source: <html> <p> A&nbsp;<em>truncated normally distributed</em> uncertainty limited by the <em>minimum</em> and the <em>maximum</em> possible value of the uncertain scalar. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> The additional parameters introduced for the truncated normal distribution are: </p> <ul> <li> <em>mean</em>: nominal value of the scalar is the mean value of non-truncated normal distribution. </li> <li> <em>stdDev</em>: standard deviation of non-truncated normal distribution. </li> </ul> <p> For example, the parameter&nbsp;<var>R</var> of a&nbsp;resistor has the nominal value of 200&nbsp;&ohm;, the minimum possible value 190&nbsp;&ohm;, the maximum possible value 210&nbsp;&ohm; and the standard deviation 3&nbsp;&ohm;. This yields the following parameters of truncated normal distribution: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;%, &sigma;&nbsp;= 3&nbsp;&ohm; &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (and <code>absTol&nbsp;= 0</code>), <code>stdDev&nbsp;= 3</code> or </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm;, &sigma;&nbsp;= 3&nbsp;&ohm; &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (and <code>relTol&nbsp;= 0</code>), <code>stdDev&nbsp;= 3</code>. </li> </ul> <p> The Modelica Standard Library provides <a href="modelica://Modelica.Math.Distributions.TruncatedNormal">Modelica.Math.Distributions.TruncatedNormal</a>. For more details of the normal distribution or of truncated distributions, see Wikipedia &ndash; <a href="http://en.wikipedia.org/wiki/Normal_distribution">normal distribution</a> or <a href="http://en.wikipedia.org/wiki/Truncated_distribution">truncated distribution</a>, respectively. </p> </html>
de: <html> <p> Eine <em>abgeschnittene normalverteilte</em> Unsicherheit, die durch den <em>kleinst-</em> und den <em>größtmöglichen Wert</em> des unsicheren Skalars begrenzt ist. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Die zusätzlichen Parameter, die für die abgeschnittene Normalverteilung eingeführt wurden, sind: </p> <ul> <li> <em>mean</em>: Nominalwert des Skalars ist der Mittelwert der nicht abgeschnittenen Normalverteilung. </li> <li> <em>stdDev</em>: Standardabweichung der nicht abgeschnittenen Normalverteilung. </li> </ul> <p> Zum Beispiel hat der Parameter&nbsp;<var>R</var> eines elektrischen Widerstands den Nominalwert von 200&nbsp;&ohm;, den kleinstmöglichen Wert 190&nbsp;&ohm; und den größtmöglichen Wert 210&nbsp;&ohm; und die Standardabweichung 3&nbsp;&ohm;. Das führt zu folgenden Parametern der abgeschnittenen Normalverteilung: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;%, &sigma;&nbsp;= 3&nbsp;&ohm; &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (und <code>absTol&nbsp;= 0</code>), <code>stdDev&nbsp;= 3</code> oder </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm;, &sigma;&nbsp;= 3&nbsp;&ohm; &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (und <code>relTol&nbsp;= 0</code>), <code>stdDev&nbsp;= 3</code>. </li> </ul> <p> In der Modelica-Standardbibliothek steht <a href="modelica://Modelica.Math.Distributions.TruncatedNormal">Modelica.Math.Distributions.TruncatedNormal</a>. zur Verfügung. Für weitere Einzelheiten der Gleichverteilung oder der abgeschnittenen Verteilung siehe Wikipedia &ndash; <a href="http://en.wikipedia.org/wiki/Normal_distribution">Gleichverteilung</a> bzw. <a href="http://en.wikipedia.org/wiki/Truncated_distribution">abgeschnittene Verteilung</a>. </p> </html>

# Credibility.Types.TruncatedNormalTolerance
source: Uncertainty defined by truncated normal distribution with tolerance
de: Unsicherheit definiert als abgeschnittene Normalverteilung mit Toleranz

# Credibility.Types.TruncatedNormalTolerance
source: Nominal value
de: Sollwert

# Credibility.Types.TruncatedNormalTolerance
source: Limits: |value - nominal| <= max(absTol,relTol*|nominal|)
de: Grenzwerte: |value - nominal| <= max(absTol, relTol*|nominal|)

# Credibility.Types.TruncatedNormalTolerance
source: Standard deviation = max(absTol,relTol*|nominal|)/stdDevFactor
de: Standardabweichung = max(absTol, relTol*|nominal|)/stdDevFactor
