Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.Types.TruncatedNormalTolerance
source: <html> <p> A&nbsp;<em>truncated normally distributed</em> uncertainty. The minimum and the maximum possible value of the uncertain scalar is described by a&nbsp;<em>nominal value</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> uncertainty for general information. </p> <p> Similarly to <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a>, this description utilizes: </p> <ul> <li> <em>nominal</em>: nominal value of the scalar. Typically, the nominal value is used as default for the actual parameter value. </li> <li> <em>relTol</em>: relative tolerance of limits with respect to nominal (default = 0.0). </li> <li> <em>absTol</em>: absolute tolerance of limits with respect to nominal (default = 0.0). </li> </ul> <p> And, additionally, </p> <ul> <li> <em>stdDevFactor</em>: factor of tolerance to standard deviation of (non-truncated) normal distribution. </li> </ul> <p> Consequently, the parameters of the underlaid <a href="modelica://Credibility.Types.TruncatedNormal">truncated normal distribution</a>, are computed from the given parameterization in the following way: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|) lower = nominal &minus; tol upper = nominal + tol stdDev = tol/stdDevFactor </pre></blockquote> <p> For example, the parameter&nbsp;<var>R</var> of a&nbsp;resistor has the nominal value of 200&nbsp;&ohm;, the minimum possible value of 190&nbsp;&ohm; and the maximum possible value 210&nbsp;&ohm;. These limits are considered being at 2*stdDev (standard deviation &sigma;) of the <em>non-truncated</em> normal distribution, i.e. at a&nbsp;probability of 95.4&nbsp;%. This yields the following parameters of truncated normal distribution: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;%, 2&sigma; &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (and <code>absTol&nbsp;= 0</code>), <code>stdDevFactor&nbsp;= 2</code> or </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm;, 2&sigma; &rArr; parameters <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (and <code>relTol&nbsp;= 0</code>), <code>stdDevFactor&nbsp;= 2</code>. </li> </ul> </html>
de: <html> <p> Eine <em>abgeschnittene normalverteilte</em> Unsicherheit. Die <em>kleinst-</em> und die <em>größtmöglichen Werte</em> des unsicheren Skalars sind durch einen <em>Nominalwert</em> und ein <em>Intervall</em> beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty">BaseUncertainty</a> für allgemeine Informationen. </p> <p> Ähnlich zu <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a>, verwendet diese Beschreibung: </p> <ul> <li> <em>nominal</em>: Nominalwert vom Skalar. Typischerweise wird der Nominalwert als Vorgabe für den eigentlichen Parameterwert verwendet. </li> <li> <em>relTol</em>: relative Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0). </li> <li> <em>absTol</em>: absolute Toleranz der Grenzwerte bezüglich Nominalwert (default&nbsp;=&nbsp;0.0), </li> </ul> <p> und zusätzlich noch </p> <ul> <li> <em>stdDevFactor</em>: Toleranzfaktor für Standardabweichung der (nicht abgeschnittenen) Normalverteilung. </li> </ul> <p> Somit werden aus der gegebenen Parametrierung die Parameter der unterlegten <a href="modelica://Credibility.Types.TruncatedNormal">abgeschnittenen Normalverteilung</a> wie folgt berechnet: </p> <blockquote><pre> tol = max(absTol, relTol * |nominal|) lower = nominal &minus; tol upper = nominal + tol stdDev = tol/stdDevFactor </pre></blockquote> <p> Zum Beispiel hat der Parameter&nbsp;<var>R</var> eines elektrischen Widerstands den Nominalwert von 200&nbsp;&ohm;, den kleinstmöglichen Wert 190&nbsp;&ohm; und den größtmöglichen Wert 210&nbsp;&ohm;. Weiterhin wird angenommen, dass diese Grenzen bei 2*stdDev (Standardabweichung &sigma;) der <em>nicht abgeschnittenen</em> Normalverteilung liegen, d.h. deren Wahrscheinlichkeit liegt bei 95.4&nbsp;%. Das ergibt folgende Parameter der abgeschnittenen Normalverteilung: </p> <ul> <li> 200&nbsp;&ohm; &plusmn; 5&nbsp;%, 2&sigma; &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>relTol&nbsp;= 0.05</code> (und <code>absTol&nbsp;= 0</code>), <code>stdDevFactor&nbsp;= 2</code> oder </li> <li> (200 &plusmn;&nbsp;10)&nbsp;&ohm;, 2&sigma; &rArr; Parameter <code>unitValue&nbsp;="Ohm"</code>, <code>nominal&nbsp;= 200</code>, <code>absTol&nbsp;= 10</code> (und <code>relTol&nbsp;= 0</code>), <code>stdDevFactor&nbsp;= 2</code>. </li> </ul> </html>

# Credibility.Types.BaseUncertainty1D
source: Basic uncertainty definitions of 1D tables
de: Elementare Unsicherheitsdefinition von 1D-Tabelle

# Credibility.Types.BaseUncertainty1D
source: Kind of 1D uncertainty
de: Art der 1D-Unsicherheit

# Credibility.Types.BaseUncertainty1D
source: Source of uncertainty
de: Quelle der Unsicherheit

# Credibility.Types.BaseUncertainty1D
source: Information about the source
de: Information über die Quelle

# Credibility.Types.BaseUncertainty1D
source: Reference of the source
de: Referenz der Quelle

# Credibility.Types.BaseUncertainty1D
source: Convex scaling between -1 (= lower limits), 0 (= nominal) and 1 (= upper limits)
de: %name

# Credibility.Types.BaseUncertainty1D
source: <html> <p> A&nbsp;common uncertainty setup for a&nbsp;<em>real 1d&nbsp;table parameter</em>. Besides <em>source</em>, <em>info</em> and <em>reference</em>, detailed in <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a>, inherent limits of a&nbsp;physical quantity (i.e., upper and lower limits of table values) are defined here, independent of the kind of the mathematical description of the uncertainty. Additionally, the uncertain parameter <code>lambda</code> is aimed for scaling between lower limits (for <code>lambda&nbsp;= -1</code>), nominal values (<code>lambda&nbsp;= 0</code>) and upper limits (<code>lambda&nbsp;= 1</code>), see <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a>. </p> <p> A&nbsp;particular mathematical description is, then, provided with the derived uncertainty types, see e.g. <a href="modelica://Credibility.Types.Interval1D">Interval1D</a> or <a href="modelica://Credibility.Types.TruncatedNormalTolerance1D">TruncatedNormalTolerance1D</a>. </p> </html>
de: <html> <p> Eine allgemeine Unsicherheitseinstellung für eine <em>reele Parameter 1D-Tabelle</em>. Neben der <em>Quelle (source)</em>, der <em>Information (info)</em> und der <em>Referenz (reference)</em>, näher beschrieben im <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a>, sind hier auch die inhärenten Grenzen einer physikalischen Größe (d.h. Ober- und Untergrenzen der Tabellenwerte) definiert, unabhängig von der Art der mathematischen Beschreibung der Unsicherheit. Der zusätzliche Unsicherheitsparameter <code>lambda</code> ist für Skalierung zwischen Untergrenzen (für <code>lambda&nbsp;= -1</code>), Nennwerten (<code>lambda&nbsp;= 0</code>) und Obergrenzen (<code>lambda&nbsp;= 1</code>) angedacht, siehe <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a>. </p> <p> Eine konkrete mathematische Beschreibung wird dann mit den abgeleiteten Unsicherheitstypen bestimmt, siehe z.B. <a href="modelica://Credibility.Types.Interval1D">Interval1D</a> oder <a href="modelica://Credibility.Types.TruncatedNormalTolerance1D">TruncatedNormalTolerance1D</a>. </p> </html>

# Credibility.Types.Interval1D
source: Interval uncertainty of lambda for table1D (epistemic uncertainty)
de: Intervallunsicherheit von lambda für 1D-Tabelle (erkenntnistheoretische Unsicherheit)

# Credibility.Types.Interval1D
source: = true, if uncertainty defined by tolerance
de: = true, wenn Unsicherheit durch Toleranz definiert

# Credibility.Types.Interval1D
source: Table matrix (columns: 1 = input/grid; 2 = nominal values; 3 = lower limits; 4 = upper limits)
de: Tabellenmatrix (Spalten: 1 = Input/Gitternetz; 2 = Nominalwerte; 3 = Untergrenzen; 4 = Obergrenzen)

# Credibility.Types.Interval1D
source: <html> <p> An <em>epistemic</em> uncertainty of 1d table, i.e. the uncertainty <em>due to lack of knowledge</em> &ndash; e.g., on the side of model, analysis or experiment. The uncertainty is described only by vectors of the <em>minimum</em> and the <em>maximum</em> possible values of the uncertain table. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <p> The <em>nominal</em>, <em>minimum</em> and <em>maximum</em> vectors are all collected in <code>table</code>. To use this uncertainty in an optimization run that determines improved control parameters or during a&nbsp;Monte Carlo simulation to propagate uncertainties to output variables, the uncertain parameter <code>lambda</code> is introduced. It is aimed to enable convex scaling between lower limits (for <code>lambda&nbsp;= -1</code>), nominal values (<code>lambda&nbsp;= 0</code>) and upper limits (<code>lambda&nbsp;= 1</code>). </p> </html>
de: <html> <p> Eine <em>erkenntnistheoretische (epistemische)</em> Unsicherheit von 1D-Tabelle, d.h. die Unsicherheit <em>auf Grund von fehlendem Wissen</em> &ndash; z.B. auf der Seite des Modells, der Analyse oder des Experiments. Die Unsicherheit wird nur durch Vektoren der <em>kleinst-</em> und der <em>größtmöglichen Werte</em> der unsicheren Tabelle beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <p> Die Vektoren der <em>nominalen</em>, der <em>kleinstmöglichen</em> und der <em>größtmöglichen</em> Werte werden alle in einer <code>Tabelle</code> gesammelt. Um diese Unsicherheit zu nutzen, z.B. in einem Optimierungslauf zur Verbesserung der Reglerparameter oder während einer Monte Carlo-Simulation, um Unsicherheiten auf Ausgangsvariablen zu übertragen, wird der Unsicherheitsparameter <code>lambda</code> eingeführt. Er soll eine konvexe Skalierung zwischen Untergrenzen (für <code>lambda&nbsp;= -1</code>), Nennwerten (<code>lambda&nbsp;= 0</code>) und Obergrenzen (<code>lambda&nbsp;= 1</code>) ermöglichen. </p> </html>

# Credibility.Types.IntervalTolerance1D
source: Interval uncertainty of lambda for 1D table with tolerance (epistemic uncertainty)
de: Intervallunsicherheit von lambda für 1D-Tabelle mit Toleranz (erkenntnistheoretische Unsicherheit)

# Credibility.Types.IntervalTolerance1D
source: = true, if uncertainty defined by tolerance
de: = true, wenn Unsicherheit durch Toleranz definiert

# Credibility.Types.IntervalTolerance1D
source: Table matrix (columns: 1 = input/grid; 2 = nominal values)
de: Tabellenmatrix (Spalten: 1 = Input/Gitternetz; 2 = Nominalwerte)

# Credibility.Types.IntervalTolerance1D
source: Limits: |value[i] - table[i,2]| <= max(absTol,relTol*|table[i,2]|)
de: Grenzwerte: |value[i] - table[i,2]| <= max(absTol, relTol*|table[i,2]|)

# Credibility.Types.IntervalTolerance1D
source: <html> <p> An <em>epistemic</em> uncertainty of 1d table, i.e. the uncertainty <em>due to lack of knowledge</em> &ndash; e.g., on the side of model, analysis or experiment. The uncertainty is described by a&nbsp;<em>nominal value</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <h4>See also</h4> <ul> <li> <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a> for additional information. </li> <li> <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> for usability. </li> </ul> </html>
de: <html> <p> Eine <em>erkenntnistheoretische (epistemische)</em> Unsicherheit von 1D-Tabelle, d.h. die Unsicherheit <em>auf Grund von fehlendem Wissen</em> &ndash; z.B. auf der Seite des Modells, der Analyse oder des Experiments. Die Unsicherheit wird nur durch einen <em>Nominalwert</em> und ein <em>Intervall</em> beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <h4>Siehe auch</h4> <ul> <li> <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a> für zusätzliche Informationen. </li> <li> <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> für Anwendbarkeit. </li> </ul> </html>

# Credibility.Types.Uniform1D
source: Uniform distribution of lambda for table1D
de: Gleichverteilung von lambda für 1D-Tabelle

# Credibility.Types.Uniform1D
source: <html> <p> An uncertainty describing possible values of the uncertain 1d table by a&nbsp;<em>uniform distribution</em>, i.e. the probability of values&apos; outcome is equal between the <em>minimum</em> and the <em>maximum</em> limits. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <h4>See also</h4> <ul> <li> <a href="modelica://Credibility.Types.Uniform">Uniform</a> for additional information. </li> </ul> </html>
de: <html> <p> Eine Unsicherheit, die die möglichen Werte der unsicheren 1D-Tabelle durch eine <em>Gleichverteilung</em> beschreibt, d.h. die Wahrscheinlichkeit des Wertergebnisses ist zwischen der <em>Unter-</em> und der <em>Obergrenze</em> gleich. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <h4>Siehe auch</h4> <ul> <li> <a href="modelica://Credibility.Types.Uniform">Uniform</a> für zusätzliche Informationen. </li> </ul> </html>

# Credibility.Types.UniformTolerance1D
source: Uniform distribution of lambda for 1D table with tolerance
de: Gleichverteilung von lambda für 1D-Tabelle mit Toleranz

# Credibility.Types.UniformTolerance1D
source: <html> <p> An uncertainty describing possible values of the uncertain 1d table by a&nbsp;<em>uniform distribution</em>, i.e. the probability of values&apos; outcome is equal between the limits which are given by a&nbsp;<em>nominal values</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <h4>See also</h4> <ul> <li> <a href="modelica://Credibility.Types.UniformTolerance">UniformTolerance</a> for additional information. </li> <li> <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> for usability. </li> </ul> </html>
de: <html> <p> Eine Unsicherheit, die die möglichen Werte der unsicheren 1D-Tabelle durch eine <em>Gleichverteilung</em> beschreibt, d.h. die Wahrscheinlichkeit des Wertergebnisses ist zwischen der Grenzwerten, die durch einen <em>Nominalwert</em> und ein <em>Interval</em> gegeben sind, gleich. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <h4>Siehe auch</h4> <ul> <li> <a href="modelica://Credibility.Types.UniformTolerance">UniformTolerance</a> für zusätzliche Informationen. </li> </ul> </html>

# Credibility.Types.TruncatedNormal1D
source: Truncated normal distribution of lambda for table1D
de: Abgeschnittene Normalverteilung von lambda für 1D-Tabelle

# Credibility.Types.TruncatedNormal1D
source: Standard deviation of (non-truncated) normal distribution
de: Standardabweichung der (nicht abgeschnittenen) Normalverteilung

# Credibility.Types.TruncatedNormal1D
source: <html> <p> A&nbsp;<em>truncated normally distributed</em> uncertainty, limited by the <em>minimum</em> and the <em>maximum</em> possible values of 1d table. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <p> The additional parameter introduced for this truncated normal distribution is: </p> <ul> <li> <em>stdDev</em>: standard deviation of non-truncated normal distribution. </li> </ul> <h4>See also</h4> <ul> <li> <a href="modelica://Credibility.Types.TruncatedNormal">TruncatedNormal</a> </li> </ul> </html>
de: <html> <p> Eine <em>abgeschnittene normalverteilte</em> Unsicherheit, die durch den <em>kleinst-</em> und den <em>größtmöglichen Wert</em> von 1D-Tabelle begrenzt ist. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <p> Der zusätzlich eingeführte Parameter für die abgeschnittene Normalverteilung ist: </p> <ul> <li> <em>stdDev</em>: Standardabweichung der nicht abgeschnittenen Normalverteilung. </li> </ul> <h4>Siehe auch</h4> <ul> <li> <a href="modelica://Credibility.Types.TruncatedNormal">TruncatedNormal</a> </li> </ul> </html>

# Credibility.Types.TruncatedNormalTolerance1D
source: Truncated normal distribution of lambda for 1D table with tolerance
de: Abgeschnittene Normalverteilung von lambda für 1D-Tabelle mit Toleranz

# Credibility.Types.TruncatedNormalTolerance1D
source: Standard deviation = max(absTol,relTol*|nominal|)/stdDevFactor
de: Standardabweichung = max(absTol, relTol*|nominal|)/stdDevFactor

# Credibility.Types.TruncatedNormalTolerance1D
source: <html> <p> A&nbsp;<em>truncated normally distributed</em> uncertainty of 1d table. The minimum and the maximum possible values of the table are described by a&nbsp;<em>nominal value</em> and an <em>interval</em>. See also <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> uncertainty for general information. </p> <h4>See also</h4> <ul> <li> <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a> for additional information. </li> <li> <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> for usability. </li> </ul> </html>
de: <html> <p> Eine <em>abgeschnittene normalverteilte</em> Unsicherheit von 1D-Tabelle. Die <em>kleinst-</em> und die <em>größtmöglichen Werte</em> der Tabelle sind durch einen <em>Nominalwert</em> und ein <em>Intervall</em> beschrieben. Siehe auch Unsicherheit <a href="modelica://Credibility.Types.BaseUncertainty1D">BaseUncertainty1D</a> für allgemeine Informationen. </p> <p> <h4>Siehe auch</h4> <ul> <li> <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a> für zusätzliche Informationen. </li> <li> <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> für Anwendbarkeit. </li> </ul> </html>

# Credibility.Types.Traceability
source: Traceability setup
de: Einstellung der Rückverfolgbarkeit

# Credibility.Types.Traceability
source: Source of value
de: Quelle von dem Wert

# Credibility.Types.Traceability
source: Information about the source of the value and its uncertainty information
de: Information über die Quelle des Wertes und seiner Unsicherheit

# Credibility.Types.Traceability
source: URI of the source (report, data sheet, paper, ...)
de: URI der Quelle (Bericht, Datenblatt, Zeitungsartikel, ...)

# Credibility.Types.Traceability
source: <html> <p> A&nbsp;common traceability setup. See <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">User&apos;s Guide</a> for more info. </p> </html>
de: <html> <p> Eine allgemeine Rückverfolgbarkeitseinstellung für einen skalaren reelen Parameter. Für mehr Informationen siehe auch <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Benutzerhandbuch</a>. </p> </html>

# Credibility.Types.UndefinedCalibration
source: No calibration defined
de: Keine Kalibrierung definiert

# Credibility.Types.UndefinedCalibration
source: <html> <p> A&nbsp;calibration type for undefined case. </p> </html>
de: <html> <p> Ein Kalibrierungstyp für undefinierten Fall. </p> </html>

# Credibility.Types.Calibration
source: Calibration setup for scalar parameter
de: Kalibrierungseinstellung für einen skalaren Parameter

# Credibility.Types.Calibration
source: Unit of value
de: Werteinheit

# Credibility.Types.Calibration
source: Start value for calibration
de: Anfangswert der Kalibrierung

# Credibility.Types.Calibration
source: Minimum value used for calibration
de: Mindestwert der Kalibrierung

# Credibility.Types.Calibration
source: Maximum value used for calibration
de: Höchstwert der Kalibrierung

# Credibility.Types.Calibration
source: URL of calibration setup script
de: URL des Scripts für Kalibrierungseinstellung

# Credibility.Types.Calibration
source: <html> <p> A&nbsp;common calibration setup for a&nbsp;scalar real parameter. See also <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">User&apos;s Guide</a> for more info. </p> </html>
de: <html> <p> Eine allgemeine Kalibrierungseinstellung für einen skalaren reelen Parameter. Für mehr Informationen siehe auch <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">Benutzerhandbuch</a>. </p> </html>

# Credibility.Utilities
source: Collection of utility elements used in the library
de: Sammlung von Hilfselementen für die Bibliothek

# Credibility.Utilities
source: <html> <p> This package contains auxiliary utilities that can be used within the library. </p> </html>
de: <html> <p> Dieses Paket beinhaltet Hilfsklassen, die in der ganzen Bibliothek verwendet werden können. </p> </html>

# Credibility.Utilities.Table1DScalings
source: Functions for evaluation of credible 1D tables
de: Funktionen zur Evaluierung von glaubwürdigen 1D-Tabellen

# Credibility.Utilities.Table1DScalings
source: <html> <p> This package contains scaling functions used in <a href="modelica://Credibility.Table1D">Table1D</a> to compute &quot;table[i,j]&quot; from the given &quot;uncertainty&quot; matrix. For further details, refer to <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a> &ndash; &quot;Convex scaling by uncertain parameter&nbsp;<var>&lambda;</var>&quot;. </p> </html>
de: <html> <p> Dieses Paket beinhaltet Skalierungsfuntionen, die in <a href="modelica://Credibility.Table1D">Table1D</a> verwendet werden, um &quot;table[i,j]&quot; aus der gegebenen &quot;uncertainty&quot;-Matrix zu berechnen. Für weitere Einzelheiten siehe <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a> &ndash; &quot;Konvexe Skalierung mit unsicherem Parameter&nbsp;<var>&lambda;</var>&quot;. </p> </html>

# Credibility.Utilities.Table1DScalings.getTableLambdaByInterval
source: Calculate scaled table by lower and upper limits
de: Berechne skalierte Tabelle mithilfe Unter- und Obergrenzen

# Credibility.Utilities.Table1DScalings.getTableLambdaByInterval
source: Convex scaling between -1 and 1 (=0: nominal)
de: Konvexe Skalierung zwischen -1 und 1 (=0: nominal)

# Credibility.Utilities.Table1DScalings.getTableLambdaByInterval
source: Table uncertainty (x, y, yL, yU)
de: Unsicherheit der Tabelle (x, y, yL, yU)

# Credibility.Utilities.Table1DScalings.getTableLambdaByInterval
source: Value of table
de: Tabellenwerte
