Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: J from datasheet; Init defined by system spec or scenario spec
de: J aus dem Datenblatt; Init definiert durch Systemspezifikation oder Szenariospecifikation

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: table from datasheet; Init defined by system spec or scenario spec
de: Tabelle aus dem Datenblatt; Init definiert durch Systemspezifikation oder Szenariospecifikation

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: d to be calibrated; Init defined by system spec or scenario spec
de: d zur Kalibrierung; Init definiert durch Systemspezifikation oder Szenariospecifikation

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: Guess value, with defined uncertainty; Init defined by system spec or scenario spec
de: Schätzwert mit definierter Unsicherheit; Init definiert durch Systemspezifikation oder Szenariospecifikation

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: plant (simple drive train)
de: Regelanlage (einfacher Antriebstrang)

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: <html> <p> This is a&nbsp;simple drive train consisting of the following elements: </p> <ul> <li> A&nbsp;motor inertia that is driven by an external torque. </li> <li> The measured motor speed (=&nbsp;angular velocity) provided as output signal. </li> <li> A&nbsp;load inertia. </li> <li> A&nbsp;gearbox. The compliance of the gearbox is modelled with <strong>a&nbsp;nonlinear spring defined with a&nbsp;table and a&nbsp;linear damper</strong>. The compliance is modelled because it limits the performance of a&nbsp;controller. </li> </ul> <p> Typically, a&nbsp;controller is designed to compute the motor torque, from the measured motor speed and a&nbsp;provided reference speed of the motor (= reference speed of the load, because the gear ratio is one). Furthermore, an external torque might be applied on the load inertia. </p> <p> All the significant parameters of the drive train are provided via the record instance <code>data</code> containing the values of the parameters, as well as information about the credibility of the parameters. </p> <h4>Initialization</h4> <p> The initialization is a&nbsp;bit tricky. The goal is to initialize in steady state because initial transients are then no longer present. However, this depends on the controller that is generating the motor torque. Furthermore, when exporting the model as FMU, the FMU must be also reasonably initialized. Since this partial model has four states (e.g., <code>inertiaLoad.phi</code>, <code>inertiaLoad.w</code>, <code>damper.phi_rel</code> and <code>damper.w_rel</code>), four initial conditions have to be provided. Typically, the user is interested in the load position/speed, not in the motor position/speed. Therefore, the following initialization is defined: </p> <ul> <li> The load angle and load angular velocity are both initialized to zero. Note, if standard steady state initialization would be performed, then the load angle would be undefined. When a&nbsp;controller is added to the model and steady-state initialization is desired, then the load angular acceleration should also be set to zero, provided the controller has at least one state (e.g. a&nbsp;PI controller) that can be computed from this setting, cf. initialization of <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a>. </li> <li> The relative angular velocity and relative angular acceleration of the gear/compliance are both initialized to zero, see <code>damper</code> element which is, therefore, initialized in steady state. </li> </ul> </html>
de: <html> <p> Einfacher Antriebstrang bestehend aus folgenden Elementen: </p> <ul> <li> Eine durch das externe Drehmoment angetriebene Motorträgheit. </li> <li> Eine als Ausgangssignal bereitgestellte gemessene Motorgeschwindigkeit (=&nbsp;Winkelgeschwindigkeit). </li> <li> Eine Lastträgheit. </li> <li> Ein Getriebe. Die Nachgiebigkeit des Getriebes ist modelliert mit <strong>einer nichtlinearen tabellenbasierten Feder und einem linearen Dämpfer</strong>. Die Nachgiebigkeit ist modelliert, weil es die Performanz des Reglers begrenzt. </li> </ul> <p> Typischerweise ist ein Regler zur Regelung des Drehmoments auf Grund der gemessenen Motorgeschwindigkeit und einer gegebenen Sollgeschwindigkeit (= Referenzgeschwindigkeit der Last, da Getriebeübersetzung gleich eins ist) ausgelegt. Außerdem kann ein externes Drehmoment auf die Lastträgheit wirken. </p> <p> Alle wichtigen Parameter des Antriebstrangs sind über die Record-Instanz <code>data</code> gegeben. Diese beinhaltet neben den Parameterwerten auch Informationen zur Parameterglaubwürdigkeit. </p> <h4>Initialisierung</h4> <p> Die Initialisierung ist ein wenig knifflig. Das Ziel ist es, in einem stationären Zustand zu initialisieren, da dann keine anfänglichen Transienten mehr vorhanden sind. Dies ist jedoch vom Regler abhängig, der das Motordrehmoment generiert. Außerdem muss auch ein exportiertes FMU des Modells sinnvoll initialisiert werden. Da dieses Teilmodell vier Zustände hat (e.g., <code>inertiaLoad.phi</code>, <code>inertiaLoad.w</code>, <code>damper.phi_rel</code> und <code>damper.w_rel</code>), müssen vier Anfangsbedingungen definiert werden. Typischerweise sind die Position und die Geschwindigkeit der Last vom Interesse, nicht jedoch die des Motors, weshalb folgende Initialisierung angestrebt wird: </p> <ul> <li> Der Winkel und die Winkelgeschwindigkeit der Last sind beide auf Null initialisiert. Dabei muss man beachten, dass der Lastwinkel undefiniert wäre, wenn eine Standardinitialisierung im stationären Zustand durchgeführt würde. Wenn dem Modell ein Regler hinzugefügt wird und eine stationäre Initialisierung gewünscht ist, dann sollte zusätzlich die Winkelbeschleunigung der Last auf Null gesetzt werden, vorausgesetzt der Regler hat mindestens einen Zustand (z.B. ein PI-Regler), der aus dieser Einstellung berechnet werden kann, siehe Initialisierung von <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a>. </li> <li> Die relative Winkelgeschwindigkeit und die relative Winkelbeschleunigung des Getriebes/der Nachgiebigkeit sind beide auf Null initialisiert, siehe Initialisierung vom <code>damper</code>, das im stationären Zustand initialisiert ist. </li> </ul> </html>

source: Controlled drive train
de: Geregelter Antriebstrang

source: Reference distance to move
de: Referenzdistanz für Bewegung

source: k, Ti, Ni: defined from control development, to be tested on control robustness ; yMax, yMin: from system spec; Init defined by optimization scenario spec
de: k, Ti, Ni: definiert durch Reglerauslegung, soll auf Robustheit getestet werden ; yMax, yMin: aus Systemspezifikation; Init definiert durch Specifikation vom Optimierungsszenario

source: reference
de: Referenz

source: controller
de: Regler

source: <html> <p> This is a&nbsp;simple nonlinear drive train controlled by a&nbsp;PI controller, based on <a href="modelica://Modelica.Blocks.Examples.PID_Controller">Modelica.Blocks.Examples.PID_Controller</a>. </p> <p> It serves as an example for the use of the Credibility library. </p> <p> Detailed information can be found in [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]). </p> </html>
de: <html> <p> Einfacher nichtlinearer Antriebstrang geregelt mit einen PI-Regler, der auf <a href="modelica://Modelica.Blocks.Examples.PID_Controller">Modelica.Blocks.Examples.PID_Controller</a> basiert. </p> <p> Es dient als ein Beispiel zur Verwendung der Credibility-Bibliothek. </p> <p> Nähere Information kann man in [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]) finden. </p> </html>

source: Drive train for virtual measurements
de: Antriebstrang für virtuelle Messungen

source: Exact value of damping constant used for virtual measurement
de: Genauer Wert der Dämpferkonstante, verwendet für virtuelle Messungen

source: k, Ti, Ni: defined from control development, to be tested on control robustness ; yMax, yMin: from system spec; Init defined by optimization scenario spec
de: k, Ti, Ni: definiert durch Reglerauslegung, soll auf Robustheit getestet werden ; yMax, yMin: aus Systemspezifikation; Init definiert durch Specifikation vom Optimierungsszenario

source: tau: guess value with uncertainty, could be dynamic load (boundary condition)
de: tau: Schätzwert mit Unsicherheit, kann dynamische Last sein (Randbedingung)

source: Connector of Real output signal
de: Konnektor vom reelen Ausgangsignal

source: reference speed generation
de: Generierung von Referenzgeschwindigkeit

source: Exact value used for virtual measurement
de: Genauer Wert verwendet für virtuelle Messungen

source: controller
de: Regler

source: <html> <p> A&nbsp;controlled simple drive train to generate noisy signals of speed sensors. The signals <code>noisyMotorSpeed</code> and <code>noisyLoadSpeed</code> can be used as virtual measurements for <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_forCalibration">model calibration</a>, whereby this example is configured in a&nbsp;way especially suitable for calibration of the damping parameter <code>damper.d</code>. Therefore, <code>damper.d</code> is set to its nominal value of 100&nbsp;N&middot;m&middot;s/rad here, which is the value a&nbsp;successful calibration shall striver. </p> <p> A&nbsp;suitable reference motor speed for calibration of this drive train configuration is prescribed by block <code>sine</code> which generates a&nbsp;sine sweep signal of constant amplitude. It is used as a&nbsp;reference value of the feedback controller which commands a&nbsp;motor torque for the drive train. </p> </html>
de: <html> <p> Ein einfacher geregelter Antriebstrang, um verrauschte Signale der Geschwindigkeitssensoren zu generieren. Die Signale <code>noisyMotorSpeed</code> und <code>noisyLoadSpeed</code> können als virtuelle Messsignale in der <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_forCalibration">Modellkalibrierung</a>, verwendet werden, wobei dieses Beispiel in einer besonders für die Kallibrierung vom Dämpferparameter <code>damper.d</code> geeigneter Weise konfiguriert ist. Dafür ist hier <code>damper.d</code> auf sein Nominalwert 100&nbsp;N&middot;m&middot;s/rad gesetzt &ndash; ein Wert, das eine erfolgreiche Kallibrierung anstreben sollte. </p> <p> Eine geeignete Referenzmotordrehzahl für die Kalibrierung dieser Antriebstrangkonfiguration wird durch den Block <code>sine</code> vorgegeben, der ein Sinus-Sweep-Signal mit konstanter Amplitude erzeugt. Es wird als Referenzwert für den Feedback-Regler verwendet, der ein Motordrehmoment für den Antriebsstrang vorgibt. </p> </html>

source: Base model for calibration
de: Basismodell für Kalibrierung

source: Reference distance to move
de: Referenzdistanz für Bewegung

source: k, Ti, Ni: defined from control development, to be tested on control robustness ; yMax, yMin: from system spec; Init defined by optimization scenario spec
de: k, Ti, Ni: definiert durch Reglerauslegung, soll auf Robustheit getestet werden ; yMax, yMin: aus Systemspezifikation; Init definiert durch Specifikation vom Optimierungsszenario

source: tau: guess value with uncertainty, could be dynamic load (boundary condition)
de: tau: Schätzwert mit Unsicherheit, kann dynamische Last sein (Randbedingung)

source: Input for criteria 1: Difference between simulated and measured angular velocities of motor
de: Eingabe für Kriterium 1: Unterschied zwischen simulierter und gemessener Winkelgeschwindigkeit von Motor

source: Input for criteria 2: Difference between simulated and measured angular velocities of load
de: Eingabe für Kriterium 2: Unterschied zwischen simulierter und gemessener Winkelgeschwindigkeit von Last

source: sweep excitation
de: Sweep-Anregung

source: controller
de: Regler

source: <html> <p> A&nbsp;controlled simple drive train to be used for calibration, see also <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">User&apos;s Guide</a>. It consists of an excitation block <code>sine</code> that generates a&nbsp;sine sweep signal with constant amplitude and increasing frequency as reference value for the feedback controller <code>speedController</code>. The controller commands a&nbsp;motor torque for the drive train. Two sensors measure the angular velocities of the motor and load inertias. Measurement data, generated in a&nbsp;preprocessing step by means of a&nbsp;<a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_virtualMeasurement">virtual test rig</a>, is provided as table <code>measurementsTable</code>. </p> <h4>Calibration setup</h4> <p> The calibration criteria itself are not defined here and shall be composed by the user for the optimization-based calibration. As criteria input, the differences between simulated and measured data of motor and load angular velocities can be utilized, calculated in <code>diffSpeedMotor</code> and <code>diffSpeedLoad</code>, respectively. </p> <p> To further configure the calibration optimization setup, the predefined calibration data of the drive train parameters, stored directly in the record <code>data</code>, shall be widely used. Let us demonstrate this on the calibration of the damping parameter <code>damper.d</code> as follows. </p> <p> The calibration optimization setup consists of the nominal model with a&nbsp;starting value for the damping parameter of 300&nbsp;N&middot;m&middot;s/rad and an assumed possible range for the parameter of [1,&nbsp;1000]&nbsp;N&middot;m&middot;s/rad. Then, the optimization tuner setting shall be </p> <ul> <li> tuner1.value = <code>data.damping.calibration.start</code> (=&nbsp;300), </li> <li> tuner1.min = <code>data.damping.calibration.lower</code> (=&nbsp;1), </li> <li> tuner1.max = <code>data.damping.calibration.upper</code> (=&nbsp;1000). </li> </ul> <p> After a&nbsp;successful optimization run, the resulting optimal parameter value shall be stored (manually) in <code>data.damping.value</code>, together with its assumed uncertainty. </p> </html>
de: <html> <p> Ein einfacher geregelter Antriebstrang, der für Kalibrierung verwendet werden kann, siehe auch <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">Benutzerhandbuch</a>. Es besteht aus dem Block der <code>sine</code>-Anregung, der das Sinus-Sweep-Signal von konstanter Amplitude und steigender Frequenz als Referenzwert für den Feedback-Regler <code>speedController</code> erzeugt. Der Regler regelt das Motordrehmoment für den Antriebstrang. Zwei Sensoren messen Winkelgeschwindigkeit von der Motor- und der Lastträgheit. Messdaten, die in der Vorprozessierung mit Hilfe vom <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_virtualMeasurement">Prüfstand für virtuelle Messungen</a> generiert wurden, sind in der Tabelle <code>measurementsTable</code> gegeben. </p> <h4>Kalibrierungseinstellung</h4> <p> Die Kalibrierungskriterien selbst sind hier nicht definiert und müssen für die optimierungsbasierte Kalibrierung vom Benutzer zusammengestellt werden. Als Kriterieneingang können die Differenzen zwischen simulierten und gemessenen Daten der Winkelgeschwindigkeiten von Motor und Last verwendet werden, die in <code>diffSpeedMotor</code> bzw. <code>diffSpeedLoad</code> berechnet werden. </p> <p> Um die Optimierungseinstellung der Kalibrierung weiter zu konfigurieren, sollen möglichst die vordefinierten Kalibrierungsdaten von Antriebstrangparametern verwendet werden, die direkt im Record <code>data</code> gespeichert sind. Dies wird im Folgenden am Besipiel der Kalibrierung vom Dämpfungsparameter <code>damper.d</code> demonstriert. </p> <p> Die Optimierungseinstellung der Kalibrierung besteht aus dem Nominalmodell mit einem Anfangswert für das Dämpfungsparameter von 300&nbsp;N&middot;m&middot;s/rad und einem angenommenen Gültigkeitsbereich des Parameters von [1,&nbsp;1000]&nbsp;N&middot;m&middot;s/rad. In dem Fall soll die Einstellung von Optimierungs-Tuners sein: </p> <ul> <li> tuner1.value = <code>data.damping.calibration.start</code> (=&nbsp;300), </li> <li> tuner1.min = <code>data.damping.calibration.lower</code> (=&nbsp;1), </li> <li> tuner1.max = <code>data.damping.calibration.upper</code> (=&nbsp;1000). </li> </ul> <p> Nach einem erfolgreichen Optimierungsdurchlauf soll der resultierende optimale Parameterwert zusammen mit dessen angenommener Unsicherheit (manuell) in <code>data.damping.value</code> gespeichert werden. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: Original model parameterized with DataVariant001 for FMU generation
de: Originalmodell parametrisiert mit DataVariant001 für FMU-Generierung

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: Reference distance to move
de: Referenzdistanz für Bewegung

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: Accelerating torque acting at flange (= -flange.tau)
de: Beschleunigendes Drehmoment auf flange (= -flange.tau)

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: Absolute angular velocity of motor inertia
de: Absolute Drehgeschwindigkeit von Massenträgheit des Motors

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: Absolute angular velocity of load inertia
de: Absolute Drehgeschwindigkeit von Massenträgheit der Last

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: to FMU
de: zu FMU

# Credibility.Examples.SimpleControlledDriveNonlinear.SimpleDrive_forFMU
source: <html> <p> Example model for the geration of an FMU for <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a>. </p> </html>
de: <html> <p> Beispielmodell für Generierung von FMU für <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a>. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities
source: Collection of utility models for examples
de: Sammlung von Zusatzmodellen für Beispiele

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities
source: <html> <p> This package contains some utility components used by package examples. These components are auxiliary components that should not be used like &quot;true&quot; components of the library since they are designed for the purpose of the examples only. </p> </html>
de: <html> <p> Dieses Paket beinhaltet einige Zusatzkomponenten für Beispiele. Diese Komponenten sind Hilfsbauteile, die nicht als "&quot;echte&quot; Komponenten der Bibliothek verwendet werden sollen, weil sie nur zum Zwecke der Beispiele implementiert sind. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Nonlinear rotational spring
de: Nichtlineare Drehfeder

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Unstretched spring angle
de: Ungedehnter Drehwinkel der Feder

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: True, if stiffness table is defined on file
de: = true, falls die Steifigkeitstabelle in einer Datei definiert

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Spring characteristics
de: Federcharakteristik

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Spring stiffness [N.m.rad-1] (col. 2) vs. deflection angle delta_phi_rel [rad] (col. 1)
de: Federsteifigkeit [N.m.rad-1] (Sp. 2) vs. Verdrehwinkel delta_phi_rel [rad] (Sp. 1)

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: File name where table is stored
de: Name der Datei mit der Tabelle

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Stiffness table name
de: Name der Steifigkeitstabelle

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Coefficient for scaling of torque
de: Beiwert für Skalierung vom Drehmoment

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: Force look-up table
de: Wertetabelle für Kraft

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: <html> <p> A&nbsp;1D&nbsp;rotational spring element with non-linear characteristic. The torque is defined according to: </p> <blockquote><pre> tau = k * c_nonlin(delta_phi_rel), </pre></blockquote> <p> where </p> <blockquote><pre> tau ............. resulting torque, c_nonlin ........ non-linear stiffness table, delta_phi_rel ... = phi_rel - phi_rel0, k ............... scaling coefficient. </pre></blockquote> </html>
de: <html> <p> Ein 1D&nbsp;Drehfederelement mit nichtlinearer Characteristik. Das Drehmoment ist definiert als: </p> <blockquote><pre> tau = k * c_nonlin(delta_phi_rel), </pre></blockquote> <p> mit </p> <blockquote><pre> tau ............. resultierendes Drehmoment, c_nonlin ........ Tabelle der nichtlinearen Steifigkeit, delta_phi_rel ... = phi_rel - phi_rel0, k ............... Skalierungskoeffizient. </pre></blockquote> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.Utilities.SpringNonLinear
source: translation axis
de: Translationsachse

# Credibility.Types
source: Type definitions used in the library
de: Typdefinitionen, verwendet in der Bibliothek

# Credibility.Types
source: Enumeration defining source of credibility information
de: Aufzählung (enumeration) für die Quelle der Glaubwürdigkeitsinformation

# Credibility.Types
source: Enumeration defining kind of uncertainty of scalar real parameter
de: Aufzählung (enumeration) für die Art der Unsicherheit von skalaren reelen Parametern

# Credibility.Types
source: Enumeration defining kind of uncertainty of 1D tables
de: Aufzählung (enumeration) für die Art der Unsicherheit von 1D-Tabellen

# Credibility.Types
source: <html> <p> This package contains type definitions used in the library. See also <a href="modelica://Credibility.UsersGuide.ParameterCredibility">User&apos;s Guide</a>. </p> </html>
de: <html> <p> Dieses Paket beinhaltet Typdefinitionen, die in der Bibliothek verwendet werden. Siehe auch <a href="modelica://Credibility.UsersGuide.ParameterCredibility">Benutzerhandbuch</a>. </p> </html>

# Credibility.Types.UndefinedUncertainty
source: No uncertainty defined
de: Keine Unsicherheit definiert

# Credibility.Types.UndefinedUncertainty
source: <html> <p> An uncertainty type for undefined case. </p> </html>
de: <html> <p> Ein Unsicherheitstyp für undefinierten Fall. </p> </html>

# Credibility.Types.BaseUncertainty
source: Basic uncertainty definitions
de: Elementare Unsicherheit

# Credibility.Types.BaseUncertainty
source: Kind of uncertainty
de: Art der Unsicherheit

# Credibility.Types.BaseUncertainty
source: Source of uncertainty
de: Quelle der Unsicherheit

# Credibility.Types.BaseUncertainty
source: Information about the source
de: Information über die Quelle

# Credibility.Types.BaseUncertainty
source: Reference of the source
de: Referenz der Quelle

# Credibility.Types.BaseUncertainty
source: Unit of value
de: Werteinheit

# Credibility.Types.BaseUncertainty
source: Minimum possible value (lower <= value <= upper)
de: Kleinstmöglicher Wert (lower <= value <= upper)
