Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo
source: <html> <p> This is the information about the quality of a&nbsp;parameter value and, thus, an essential part of a&nbsp;credible model. Besides a&nbsp;mathematical description of the uncertainty (see e.g. [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]), also the same information as for the <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">traceability of parameter value</a> needs to be given: </p> <ul> <li> <strong>source</strong>: origin of the uncertainty determination (e.g. <em>Estimated</em>), see <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">traceability</a>. </li> <li> <strong>info</strong> (optional): a&nbsp;short textual explanation how the uncertainty was determined. </li> <li> <strong>reference</strong> (optional): identifies the resource where the uncertainty determination is described, for example web-address, DOI, ISBN, internal report ID of a&nbsp;document, data-sheet etc. The referenced resource must be stored in a&nbsp;way that avoids accidental manipulation, e.g., in a&nbsp;version control system with a&nbsp;given hash, in order to retain the reference information reliably. </li> </ul> <p> Additionally, the mathematical description of uncertainties of scalars and of arrays/tables must be provided. Particular descriptions provided with the library are collected in package <a href="modelica://Credibility.Types.Uncertainty">Types.Uncertainty</a>. </p> <p> The treatment implemented in the library is focused on providing the information in a&nbsp;way that it can be used by models described with the Modelica language, <a href="https://fmi-standard.org">FMI</a> or <a href="https://ssp-standard.org">SSP</a>. Furthermore, not only physical/measured quantities are taken into account, but the same description form is also used to define requirements or specifications. For example, a&nbsp;simulation result must match a&nbsp;reference result with some uncertainty, or the result of a&nbsp;design must match some criteria that is specified with an uncertainty description. </p> <p> Every physical quantity has inherent limits. Therefore, the upper and lower limits of a&nbsp;scalar value need to be defined, independent of the kind of the mathematical description of the uncertainty. For this reason, the minimum information to be provided for a&nbsp;scalar parameter with an uncertainty description of any kind is: </p> <ul> <li> nominal &ndash; the nominal value of the scalar (e.g., determined by calibration). </li> <li> lower &ndash; the lowest possible value of the uncertain scalar. </li> <li> upper &ndash; the highest possible value of the uncertain scalar. </li> </ul> <p> Often, it is inconvenient to provide absolute ranges and instead, relative or absolute deviations are more practical. In the <a href="https://emphysis.github.io/pages/downloads/efmi_specification_1.0.0-alpha.4.zip">eFMI standard</a> (Section 3.2.4) tolerances for reference results are defined in a&nbsp;similar way as tolerances for numerical integration algorithms. Due to its generality, this description form of eFMI is used here as well: </p> <ul> <li> nominal &ndash; nominal value of the scalar </li> <li> relTol &ndash; relative tolerance of limits with respect to nominal (default = 0.0). </li> <li> absTol &ndash; absolute tolerance of limits with respect to nominal (default = 0.0). </li> </ul> <p> The lower and upper values are computed from these parameters in the following way: </p> <blockquote><pre> tol = max(absTol, relTol*|nominal|) lower = nominal &minus; tol upper = nominal + tol </pre></blockquote> <h5>Example</h5> <p> The resistance of an electrical resistor can be defined using following tolerances: </p> <ul> <li> 200&nbsp;&ohm;&nbsp;&plusmn;&nbsp;5&nbsp;% &ndash; limits defined with relTol&nbsp;=&nbsp;0.05 (absTol&nbsp;= 0&nbsp;&ohm;). </li> <li> 200&nbsp;&ohm;&nbsp;&plusmn;&nbsp;10&nbsp;&ohm; &ndash; limits defined with absTol&nbsp;= 10&nbsp;&ohm; (relTol&nbsp;=&nbsp;0). </li> </ul> <p> There is a&nbsp;huge literature on the mathematical description of uncertainties. [<a href="modelica://Credibility.UsersGuide.References">Riedmaier2021</a>] provides a&nbsp;comprehensive literature overview. In [<a href="modelica://Credibility.UsersGuide.References">Bouskela2011</a>], some constructs are proposed to describe uncertain values in the Modelica language. In the Credibility Library, the following uncertainty descriptions are currently provided for scalar Real parameters, see <a href="modelica://Credibility.Types">Types</a>: </p> <table border="1" cellspacing="0" cellpadding="2"> <caption align="bottom"> Examples to define uncertainty descriptions with generic and tolerance parameterizations of scalar parameters. Default values are given with &quot;=...&quot;, such as &quot;relTol=0&quot;. A&nbsp;truncated normal distribution is defined by the <code>nominal</code> value (= mean value) and the standard deviation <code>stdDev</code> of the underlying normal distribution, besides <code>lower</code> and <code>upper</code> limits. </caption> <tr> <th> Uncertainty name </th> <th> Parameters </th> <th> Uncertainty type </th> </tr> <tr> <td> <a href="modelica://Credibility.Types.Interval">Interval</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code> </td> <td> epistemic </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.Uniform">Uniform</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code> </td> <td> uniform distribution </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.TruncatedNormal">TruncatedNormal</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code>, <code>stdDev</code> </td> <td> truncated normal distribution </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code> </td> <td> epistemic </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.UniformTolerance">UniformTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code> </td> <td> uniform distribution </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code>, <code>stdDevFactor=3</code> </td> <td> truncated normal distribution </td> </tr> </table> <p> An example for a&nbsp;TruncatedNormalTolerance uncertainty of the abovementioned resistance is given in the next two figures: </p> <div> <img src="modelica://Credibility/Resources/Images/TruncatedNormalProbabilityDensity.svg" alt="Probability density of the truncated normal distribution of resistance R = 200 W plusminus 10 W, 2 sigma"> <br> <img src="modelica://Credibility/Resources/Images/TruncatedNormalCumulativeProbability.svg" alt="Cumulative probability of the truncated normal distribution of resistance R = 200 W plusminus 10 W, 2 sigma"> </div> <h4>Array uncertainty</h4> <p> Arrays occur in system modelling and analysis in various ways: </p> <ul> <li> Submodels are often approximated by tables of a&nbsp;characteristic property that have been determined by measurements, for example a&nbsp;table defining friction torque as function of relative angular velocity, or a&nbsp;table defining mass flow rate through a&nbsp;valve as function of valve position. Tables of this kind are basically defined with two or more dimensional arrays. </li> <li> Inputs of a&nbsp;system are often defined by tables as function of time. </li> <li> Outputs of a&nbsp;system might be checked against reference outputs (for example, determined from the previous version of the model or tool, from another tool or from an analytically known solution) defined by tables as function of time. The computed solution is then required to be within uncertainty ranges of the reference tables. </li> </ul> <p> All these examples have parameter arrays, where the uncertainties of the array elements need to be described. </p> <p> If a&nbsp;characteristic is determined by detailed measurements, then typically for every element upper and lower limits are known from the available measurement data. This means that the measurements can be summarized by a&nbsp;<em>nominal array</em> that has been determined by the calibration process and arrays lower and upper of the same size that define <em>lower</em> and <em>upper</em> limits, so all measured data of the respective characteristics is between these limits. Furthermore, it must be defined how to interpolate between the table values, given the vectors of the independent variables (an <var>n</var>-dimensional table is defined by <var>n</var>&nbsp;vectors of independent variables). Often, linear interpolation is used for tables derived from measurements. </p> <p> An envisaged uncertainty description with <em>generic</em> parameterization of 2-dim. array can be demonstrated in the following example. The vectors of the two independent variables are <var>u1</var>&nbsp;= [0.1, 0.2, 0.3, 0.4] and <var>u2</var>&nbsp;= [10, 20, 30]. The nominal array is a&nbsp;matrix of size [4,&nbsp;3] and, e.g., of values [110 120 130; 210 220 230; 310 320 330; 410 420 430] (i.e. <var>y</var>&nbsp;= 230 is the nominal value for <var>u1</var>&nbsp;= 0.2 and <var>u2</var>&nbsp;= 30). Both the lower and upper limits are matrices of size [4,&nbsp;3] as well and have exemplary values <var>lower</var>&nbsp;= [11 12 13; 21 22 23; 31 32 33; 41 42 43] and <var>upper</var>&nbsp;= [119 129 139; 219 229 239; 319 329 339; 419 429 439]. Thus, e.g. the uncertain table value of <var>u1</var>&nbsp;= 0.2 and <var>u2</var>&nbsp;= 30 (i.e. array element [2,&nbsp;3]) must be in the range [23&nbsp;&hellip;&nbsp;239]. </p> <h5>Convex scaling by uncertain parameter <var>&lambda;</var></h5> <p> The question arises how a&nbsp;parameter array can be used to compute the uncertainty distributions of output variables. For <em>scalar parameters</em>, the standard Monte Carlo simulation method is based on the approach to draw sufficient numbers of random numbers according to the respective distributions and for each set of selected parameter values perform a&nbsp;simulation. Such a&nbsp;procedure might not be directly applicable to <em>parameter arrays</em>, because randomly selected elements of an array might give a&nbsp;table that does not represent physics (for example, if the table output is a&nbsp;monotonically increasing function of the input, then this property might be lost if table elements are randomly selected). </p> <p> For simplicity, the following method is used for 1-dim. tables in the Library. A&nbsp;generalization to multi-dimensional tables is straightforward. A&nbsp;1-dim. table defines a&nbsp;function <var>y</var>&nbsp;= <var>f</var>&nbsp;(<var>u</var>&nbsp;) that computes the output&nbsp;<var>y</var> from the input&nbsp;<var>u</var> by interpolation in a&nbsp;table, cf. <a href="modelica://Modelica.Blocks.Tables.CombiTable1Ds">Modelica.Blocks.Tables.CombiTable1Ds</a>. The table is defined as &quot;table[i,j]&quot; with the first column &quot;table[:,1]&nbsp;= u[:]&quot; which contains the grid points&nbsp;<var>u<sub>i</sub></var>, and the second column &quot;table[:,2]&nbsp;= y[:]&quot; which contains the data&nbsp;<var>y<sub>i</sub></var> to be interpolated. This &quot;table[i,j]&quot; is computed from the given matrix &quot;uncertainty&quot; by a&nbsp;convex combination utilizing uncertain parameter <var>&lambda;</var>. Hereby, the matrix &quot;uncertainty&quot; contains </p> <ul> <li> grid values &quot;uncertainty[:,1]&nbsp;= u[:]&quot;, </li> <li> vector of <em>nominal values</em> &quot;uncertainty[:,2]&nbsp;= nominal[:]&quot;, </li> <li> vector of <em>lower</em> limits &quot;uncertainty[:,3]&nbsp;= lower[:]&quot; and </li> <li> vector of <em>upper</em> limits &quot;uncertainty[:,4]&nbsp;= upper[:]&quot;. </li> </ul> <p> The convex combination is defined in a&nbsp;way that <var>&lambda;</var>&nbsp;=&nbsp;&minus;1 results in &quot;y[i]&nbsp;= lower[i]&quot;, <var>&lambda;</var>&nbsp;=&nbsp;0 results in &quot;y[i]&nbsp;= nominal[i]&quot; and <var>&lambda;</var>&nbsp;=&nbsp;1 results in &quot;y[i]&nbsp;= upper[i]&quot;, in particular: </p> <div> <img src="modelica://Credibility/Resources/Images/equationConvexCombination.png" alt="Equation to calculate y[i] by convex combination utilizing lambda"/> </div> <p> A&nbsp;realization can be seen in <a href="modelica://Credibility.Table1D">Credibility.Table1D</a> where &quot;uncertainty&quot; table is in fact defined by parameter <code>uncertainty.table</code>. In this record, the abovementioned calculation is done in the function <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByInterval">getTableLambdaByInterval</a>. There is also implemented an alternative calculation of &quot;table[i,j]&quot; called <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a> utilizing &ndash; either relative or absolute &ndash; tolerances. </p> </html>
de: <html> <p> Es ist die Information über die Qualität eines Parameterwertes und damit ein wesentlicher Bestandteil eines glaubwürdigen Modells. Neben einer mathematischen Beschreibung der Unsicherheit (siehe z.B. [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]) sollen auch die gleichen Informationen wie bei der <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Rückverfolgbarkeit des Parameterwertes</a> angegeben werden: </p> <ul> <li> <strong>source</strong>: wie wird die Unsicherheitsbestimmung festgelegt (z.B. <em>geschätzt</em> (Estimated)), siehe <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Rückverfolgbarkeit</a>. </li> <li> <strong>info</strong> (optional): kurze inhaltliche Beschreibung, wie die Unsicherheit ermittelt wurde. </li> <li> <strong>reference</strong> (optional): identifiziert die Quelle, in der die Unsicherheitsbestimmung beschrieben wird, z.B. Web-Adresse, DOI, ISBN, ID-Nummer eines internen Berichts, Datenblatts usw. Die referenzierte Ressource muss auf eine Art und Weise gespeichert werden, die eine versehentliche Manipulation verhindert, z.B. in einem Versionskontrollsystem mit einem vorgegebenen Hashwert, damit die Referenzinformationen zuverlässig erhalten bleiben. </li> </ul> <p> Zusätzlich muss die mathematische Beschreibung der Unsicherheit von Skalaren und Felder/Tabellen vorhanden sein. Einzelne Beschreibungen, die in der Bibliothek vorhanden sind, findet man im Package <a href="modelica://Credibility.Types.Uncertainty">Types.Uncertainty</a>. </p> <p> Das in der Bibliothek implementierte Verfahren stellt die Informationen so bereit, dass sie von Modellen verwendet werden können, die in der Modelica-Sprache beschrieben sind, wie <a href="https://fmi-standard.org">FMI</a> oder <a href="https://ssp-standard.org">SSP</a>. Außerdem werden nicht nur physikalische/gemessene Größen berücksichtigt, sondern es wird dieselbe Beschreibungsform auch zur Definition von Anforderungen oder Spezifikationen verwendet. Zum Beispiel muss ein Simulationsergebnis mit einem Referenzergebnis mit einer gewissen Unsicherheit übereinstimmen, oder das Ergebnis eines Entwurfs muss einigen Kriterien entsprechen, die mit einer Unsicherheitsbeschreibung angegeben sind. </p> <p> Jede physikalische Größe hat zugehörige Grenzwerte. Daher müssen die Ober- und Untergrenze eines Skalarwerts unabhängig von der Art der mathematischen Beschreibung der Unsicherheit angegeben werden. Aus diesem Grund ergibt sich bei jedem Skalarwert für Unsicherheitsbeschreibung jeglicher Art ein Minimum an erforderlichen Angaben: </p> <ul> <li> nominal &ndash; Nominalwert vom Skalar (z.B. bestimmt durch Kalibrierung). </li> <li> lower &ndash; kleinstmögliche Untergrenze der Unsicherheit vom Skalar. </li> <li> upper &ndash; höchstmögliche Obergrenze der Unsicherheit vom Skalar. </li> </ul> <p> Oft ist es unüblich, den absoluten Wertebereich anzugeben. Dann ist statt dessen die Angabe von relativen oder absoluten Abweichungen besser geeignet. Im <a href="https://emphysis.github.io/pages/downloads/efmi_specification_1.0.0-alpha.4.zip">eFMI standard</a> (Abschnitt 3.2.4) sind Toleranzen für Referenzergebnisse vorgegeben, die ähnlich den Toleranzen für numerische Integration sind. Wegen ihrer Allgemeingültigkeit wird diese Beschreibungsform auch hier verwendet: </p> <ul> <li> nominal &ndash; Nominalwert vom Skalar. </li> <li> relTol &ndash; relative Toleranz von Grenzwerten bezüglich Nominalwert (default = 0.0). </li> <li> absTol &ndash; absolute Toleranz von Grenzwerten bezüglich Nominalwert (default = 0.0). </li> </ul> <p> Die unteren und oberen Werte werden aus diesen Parametern wie folgt berechnet: </p> <blockquote><pre> tol = max(absTol, relTol*|nominal|) lower = nominal &minus; tol upper = nominal + tol </pre></blockquote> <h5>Beispiel</h5> <p> Der Widerstand eines elektrischen Widerstands kann mit folgender Toleranz definiert werden: </p> <ul> <li> 200&nbsp;&ohm;&nbsp;&plusmn;&nbsp;5&nbsp;% &ndash; Grenzwerte definiert als relTol&nbsp;=&nbsp;0.05 (absTol&nbsp;= 0&nbsp;&ohm;). </li> <li> 200&nbsp;&ohm;&nbsp;&plusmn;&nbsp;10&nbsp;&ohm; &ndash; Grenzwerte definiert als absTol&nbsp;= 10&nbsp;&ohm; (relTol&nbsp;=&nbsp;0). </li> </ul> <p> Es gibt eine Vielzahl an Literatur über mathematische Beschreibung von Unsicherheiten. [<a href="modelica://Credibility.UsersGuide.References">Riedmaier2021</a>] fasst eine umfassende Übersicht der Literatur zusammen. In [<a href="modelica://Credibility.UsersGuide.References">Bouskela2011</a>] sind einige Konstrukte beschrieben, um Unsicherheitswerte in der Modelica-Sprache zu beschreiben. In der Credibility-Bibliothek sind momentan folgende Beschreibungen der Unsicherheit von skalaren reelen Parametern vorhanden, siehe <a href="modelica://Credibility.Types">Types</a>: </p> <table border="1" cellspacing="0" cellpadding="2"> <caption align="bottom"> Beispiele, wie Unsicherheitsbeschreibungen mit generischer und Toleranz-Parametrisierung skalarer Parameter definiert werden können. Vorgabewerte sind mit &quot;=...&quot; angegeben, wie z.B. &quot;relTol=0&quot;. Eine abgeschnittene Normalverteilung ist definiert, neben der <code>lower</code> und <code>upper</code>-Grenzwerte, durch den <code>nominal</code>-Wert (= Mittelwert) und die Standardabweichung <code>stdDev</code> der unterlegten (nicht abgeschnittenen) Normalverteilung. </caption> <tr> <th> Bezeichnung der Unsicherheit </th> <th> Parameter </th> <th> Unsicherheitstyp </th> </tr> <tr> <td> <a href="modelica://Credibility.Types.Interval">Interval</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code> </td> <td> erkenntnistheoretische (epistemische) </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.Uniform">Uniform</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code> </td> <td> Gleichverteilung </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.TruncatedNormal">TruncatedNormal</a> </td> <td> <code>nominal</code>, <code>lower</code>, <code>upper</code>, <code>stdDev</code> </td> <td> abgeschnittene Normalverteilung </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.IntervalTolerance">IntervalTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code> </td> <td> erkenntnistheoretische (epistemische) </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.UniformTolerance">UniformTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code> </td> <td> Gleichverteilung </td> </tr> <tr> <td> <a href="modelica://Credibility.Types.TruncatedNormalTolerance">TruncatedNormalTolerance</a> </td> <td> <code>nominal</code>, <code>relTol=0</code>, <code>absTol=0</code>, <code>stdDevFactor=3</code> </td> <td> abgeschnittene Normalverteilung </td> </tr> </table> <p> Ein Beispiel für TruncatedNormalTolerance-Unsicherheit vom obengenannten elektrischen Widerstand ist in den nächsten zwei Bildern dargelegt: </p> <div> <img src="modelica://Credibility/Resources/Images/TruncatedNormalProbabilityDensity.svg" alt="Wahrscheinlichkeitsdichte der abgeschnittenen Normalverteilung (truncated normal distribution) vom Widerstand R = 200 W plusminus 10 W, 2 sigma"> <br> <img src="modelica://Credibility/Resources/Images/TruncatedNormalCumulativeProbability.svg" alt="Kumulative Wahrscheinlichkeit der abgeschnittenen Normalverteilung (truncated normal distribution) vom Widerstand R = 200 W plusminus 10 W, 2 sigma"> </div> <h4>Unsicherheit von Datenfeldern</h4> <p> Datenfelder kann man in der Systemmodellierung und -Analyse auf verschiedener Art und Weise vorfinden: </p> <ul> <li> Submodelle sind oft angenähert durch Tabellen der charakteristischen Modelleigenschaften, welche durch Messungen ermittelt wurden, wie z.B. Tabelle vom Reibdrehmoment als Funktion von relativer Drehgeschwindigkeit oder eine Tabelle, die den Massenstrom durch einen Ventil als Funktion der Ventilöffnung definiert. Tabellen dieser Art sind grundlegend mit zwei- oder mehrdimensionalen Feldern definiert. </li> <li> Eingänge eines Systems sind oft mit Tabellen als Zeitfunktion definiert. </li> <li> Ausgänge eines Systems können mit Referenzwerten verglichen werden, die durch Tabellen als Zeitfunktion vorgegebenen sind, wobei die Referensignale zum Beispiel aus der vorherigen Version des Modells oder Tools stammen, oder aus einem anderen Tool oder aus einer analytisch bekannten Lösung. Die berechnete Lösung muss dann innerhalb eines Unsicherheitsregions der Referenztabellen liegen </li> </ul> <p> All diese Beispiele nutzen für Parameter Datenfelder, deren Unsicherheit beschrieben werden soll. </p> <p> Wenn eine Kennlinie durch detaillierte Messungen bestimmt wird, dann sind typischerweise für jedes Element Ober- und Untergrenzen aus den verfügbaren Messdaten bekannt. Das bedeutet, dass die Messungen durch ein <em>Nominal-Datenfeld</em> zusammengefasst werden können, das durch den Kalibrierungsprozess bestimmt wurde, und untere und obere Datenfelder der gleichen Größe, die <em>untere (lower)</em> und <em>obere (upper)</em> Grenzen definieren, so dass alle Messdaten der jeweiligen Kennlinie zwischen diesen Grenzen liegen. Außerdem muss festgelegt werden, wie zwischen den Tabellenwerten bezüglich der Vektoren von unabhängigen Variablen (eine <var>n</var>-dimensionale Tabelle wird durch <var>n</var>&nbsp;Vektoren der unabhängigen Variablen definiert) interpoliert werden soll. Für Tabellen, die aus Messungen abgeleitet sind, wird oft eine lineare Interpolation verwendet. </p> <p> Eine vorgesehene Unsicherheitsbeschreibung mit <em>generischer</em> Parametrisierung des 2-dim. Datenfeldes kann im folgenden Beispiel demonstriert werden. Die Vektoren der beiden unabhängigen Variablen sind <var>u1</var>&nbsp;= [0.1, 0.2, 0.3, 0.4] und <var>u2</var>&nbsp;= [10, 20, 30]. Das nominale Datenfeld ist eine Matrix der Größe [4,&nbsp;3] und hat z.B. die Werte [110 120 130; 210 220 230; 310 320 330; 410 420 430] (d.h. <var>y</var>&nbsp;= 230 ist der Nominalwert für <var>u1</var>&nbsp;= 0.2 und <var>u2</var>&nbsp;= 30). Sowohl die untere als auch die obere Grenze sind ebenfalls Matrizen der Größe [4,&nbsp;3] und haben die beispielhaften Werte <var>lower</var>&nbsp;= [11 12 13; 21 22 23; 31 32 33; 41 42 43] und <var>upper</var>&nbsp;= [119 129 139; 219 229 239; 319 329 339; 419 429 439]. So muss z.B. der unsichere Tabellenwert von <var>u1</var>&nbsp;= 0.2 und <var>u2</var>&nbsp;= 30 (d.h. Datenfeld-Element [2,&nbsp;3]) im Bereich [23&nbsp;&hellip;&nbsp;239] liegen. </p> <h5>Konvexe Skalierung mit unsicherem Parameter <var>&lambda;</var></h5> <p> Die Frage ist, wie kann ein Datenfeld genutzt werden, um Unsicherheitsverteilungen von Ausgangsvariablen zu berechnen. Für skalare Parameter basiert der übliche Ansatz der Monte Carlo-Simulation darauf, genügende Anzahl der Zufallszahlen nach bestimmter Verteilung zu generieren, und für jeden Satz der ausgewählten Parameterwerten eine Simulation suchzuführen. Ein solcher Ansatz ist üblicherweise nicht direkt an Parameter von Datenfelderen anwendbar, weil zufällig ausgewählte Elemente vom Datenfeld zu einer physikalich unsinnigen Tabelle führen können (z.B. kann für einen Tabellenausgang als monoton steigende Funktion des Eingangs diese Eigneschaft verloren gehen, wenn die Elemente der Tabelle zufällig ausgewählt werden.) </p> <p> Der Einfachheit halber wird der folgende Ansatz für eindimensionale Tabellen in der Bibliothek verwendet. Eine Verallgemeinerung auf mehrdimensionale Tabellen ist einfach. Eine 1-dim. Tabelle definiert eine Funktion <var>y</var>&nbsp;= <var>f</var>&nbsp;(<var>u</var>&nbsp;), die den Ausgang&nbsp;<var>y</var> aus dem Eingang&nbsp;<var>u</var> durch Interpolation in einer Tabelle berechnet, vgl. <a href="modelica://Modelica.Blocks.Tables.CombiTable1Ds">Modelica.Blocks.Tables.CombiTable1Ds</a>. Die Tabelle ist definiert als &quot;table[i,j]&quot; mit der ersten Spalte &quot;table[:,1]&nbsp;= u[:]&quot;, die die Gitterpunkte&nbsp;<var>u<sub>i</sub></var> enthält, und der zweiten Spalte &quot;table[:,2]&nbsp;= y[:]&quot;, die die zu interpolierenden Daten&nbsp;<var>y<sub>i</sub></var> enthält. Diese &quot;table[i,j]&quot; wird aus der gegebenen Matrix &quot;uncertainty&quot; durch eine konvexe Kombination berechnet, unter Verwendung des unsicheren Parameters&nbsp;<var>&lambda;</var> Dabei enthält die Matrix &quot;uncertainty&quot; </p> <ul> <li> Gitterpunkte &quot;uncertainty[:,1]&nbsp;= u[:]&quot;, </li> <li> Vektor der <em>Nominalwerte</em> &quot;uncertainty[:,2]&nbsp;= nominal[:]&quot;, </li> <li> Vektor der <em>Untergrenze</em> &quot;uncertainty[:,3]&nbsp;= lower[:]&quot; und </li> <li> Vektor der <em>Obergrenze</em> &quot;uncertainty[:,4]&nbsp;= upper[:]&quot;. </li> </ul> <p> Die konvexe Kombination ist definiert so, dass <var>&lambda;</var>&nbsp;=&nbsp;&minus;1 in &quot;y[i]&nbsp;= lower[i]&quot;, <var>&lambda;</var>&nbsp;=&nbsp;0 in &quot;y[i]&nbsp;= nominal[i]&quot; und <var>&lambda;</var>&nbsp;=&nbsp;1 in &quot;y[i]&nbsp;= upper[i]&quot; resultiert, also ist </p> <div> <img src="modelica://Credibility/Resources/Images/equationConvexCombination.png" alt="Gleichung, um y[i] mit konvexer Kombination unter Verwendung von lambda zu berechnen"/> </div> <p> Eine Realisierung kann man in <a href="modelica://Credibility.Table1D">Credibility.Table1D</a> finden, wo die &quot;uncertainty&quot;-Tabelle eigentlich durch Parameter <code>uncertainty.table</code> defineirt ist. In diesem Record ist die obengenannte Berechnung in der Funktion <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByInterval">getTableLambdaByInterval</a> durchgeführt. Es gibt auch eine alternative Berechnung von &quot;table[i,j]&quot;, genannt <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a>, die entweder relative oder absolute Toleranzen einbezieht </p> </html>
