Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.UsersGuide.ParameterCredibility.CalibrationInfo
source: Calibration information
de: Information zur Kalibrierung

# Credibility.UsersGuide.ParameterCredibility.CalibrationInfo
source: <html> <p> Once a&nbsp;model is implemented, the modeling process goes on with the calibration, validation and verification, to ensure that the model appropriately achieves the aims it was made for. Since the scope of model calibration, validation and verification is very large, we can only give a&nbsp;short overview in the context of a&nbsp;typical use case for a&nbsp;multi-physical Modelica model. <!-- For a&nbsp;broader overview on the topic, a&nbsp;recent paper [17] goes into more details and gives many additional references. --> </p> <p> The aim of the calibration process is to parameterize models with the help of measurements with regard to defined goals and criteria. For models, this generally means that they should map the behavior of the real-world system as precisely as possible. The calibration of the parameters of these models is important in order to achieve a&nbsp;good representation of the real system or to have a&nbsp;good controller performance, in the case of model-based control. </p> <p> As discussed in <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">traceability section</a>, for many physical systems the knowledge of the individual involved parameters can be quite different. For example, for the model of a&nbsp;robot, the mechanical parameters such as link lengths or masses could be known very precisely from data-sheets or CAD data, whereas the friction or damping in connecting joints can be highly unknown. Well known parameters should, thus, be included in the models directly, in order to reduce the number of unknown parameters for the calibration process. Additionally, the source of these parameters should be well documented, cf. <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">traceability</a>. </p> </html>
de: <html> <p> Sobald ein Modell implementiert ist, geht der Modellierungsprozess mit der Kalibrierung, Validierung und Verifizierung weiter, um sicherzustellen, dass das Modell die Ziele, für die es entwickelt wurde, auch wirklich erreicht. Da der Bereich der Modellkalibrierung, -validierung und -verifizierung sehr umfangreich ist, wird hier nur einen kurzen Überblick im Kontext eines typischen Anwendungsfalls für ein multiphysikalisches Modell gegeben. <!-- Einen umfassenderen Überblick über das Thema bietet ein kürzlich erschienener Artikel [17], der ausführlicher ist und viele zusätzliche Referenzen enthält. --> </p> <p> Das Ziel des Kalibrierungsprozesses ist es, Modelle mit Hilfe von Messungen im Hinblick auf definierte Ziele und Kriterien zu parametrisieren. Für Modelle bedeutet dies im Allgemeinen, dass sie das Verhalten des realen Systems so genau wie möglich abbilden sollen. Die Parameterkalibrierung dieser Modelle ist wichtig, um eine gute Darstellung des realen Systems zu erreichen oder &ndash; im Falle der modellbasierten Regelung &ndash; um eine gute Leistung des Controllers zu erzielen. </p> <p> Wie im Abschnitt <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Information zur Rückverfolgbarkeit</a> erörtert, kann bei vielen physikalischen Systemen die Kenntnis der einzelnen einbezogenen Parameter sehr unterschiedlich sein. Beim Modell eines Roboters beispielsweise können die mechanischen Parameter wie Armlängen oder Massen sehr genau aus Datenblättern oder CAD-Daten bekannt sein, während die Reibung oder Dämpfung in Gelenken weitgehend unbekannt. Bekannte Parameter sollten daher direkt in die Modelle aufgenommen werden, um die Anzahl der unbekannten Parameter für den Kalibrierungsprozess zu reduzieren. Außerdem sollte die Quelle dieser Parameter gut dokumentiert sein, vgl. <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Rückverfolgbarkeit</a>. </p> </html>

# Credibility.UsersGuide.ReleaseNotes
source: <html> <p> This section summarizes the changes that have been performed on the library. </p> <h4>Version 0.2.0 (2024-06-13)</h4> <p> The following improvements have been realized. </p> <ul> <li> Functions defined in the protected section of record <a href="modelica://Credibility.Table1D">Table1D</a> moved into package <a href="modelica://Credibility.Utilities.Table1DScalings">Utilities.Table1DScalings</a>. </li> <li> <a href="modelica://Credibility.Table1D">Table1D</a>: fix mismatching array size of <code>uncertainty.table</code> in the function call <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a>(). </li> <li> Example <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_virtualMeasurement">SimpleControlledDrive_virtualMeasurement</a>: Use &quot;fixedLocalSeed&quot; for noise generators to always get reproducible results. </li> <li> Enable multilingual descriptions and add German translation. See also Modelica Specification &ndash; <a href="https://specification.modelica.org/maint/3.6/packages.html#multilingual-descriptions">Multilingual Descriptions</a>. </li> </ul> <h4>Version 0.1.0 (2022-09-17)</h4> <ul> <li> First official release of the library. </li> </ul> </html>
de: <html> <p> Dieser Absatz fasst alle Änderungen an der Bibliothek zusammen. </p> <h4>Version 0.2.0 (2024-06-13)</h4> <p> Folgende Verbesserungen wurden umgesetzt. </p> <ul> <li> Funktionen, die im &quot;protected&quot;-Bereich des Records <a href="modelica://Credibility.Table1D">Table1D</a> definiert wurden, wurden in das Package <a href="modelica://Credibility.Utilities.Table1DScalings">Utilities.Table1DScalings</a> verschoben </li> <li> <a href="modelica://Credibility.Table1D">Table1D</a>: nicht zusammen passende Größen vom Datenfeld <code>uncertainty.table</code> im Funktionsaufruf <a href="modelica://Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance">getTableLambdaByTolerance</a>() wurden korrigiert. </li> <li> Im Beispiel <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_virtualMeasurement">SimpleControlledDrive_virtualMeasurement</a> wird &quot;fixedLocalSeed&quot; in den Rauschgeneratoren gesetzt, um stets reproduzierbare Ergebnisse zu bekommen. </li> <li> Ermöglicht mehrsprachige Beschreibungen und, zum Durchstarten, Deutsche Übersetzung. Siehe auch Modelica-Specifikation &ndash; <a href="https://specification.modelica.org/maint/3.6/packages.html#multilingual-descriptions">Multilingual Descriptions</a>. </li> </ul> <h4>Version 0.1.0 (2022-09-17)</h4> <ul> <li> Erstes offizielles Release der Bibliothek. </li> </ul> </html>

# Credibility.UsersGuide.References
source: References
de: Literatur

# Credibility.UsersGuide.References
source: <html> <p> The following books and articles have been useful for the implementation of the library. </p> <table border="0" cellspacing="0" cellpadding="2"> <!-- <tr> <td> [KeyYear] </td> <td> Author1 and Author2, &quot;Article title,&quot; <em>Journal</em>, information, year. </td> </tr> --> <tr> <td> [Otter2022] </td> <td> M. Otter, M. Reiner, J. Tobol&aacute;&rcaron;, L. Gall and M. Sch&auml;fer, &quot;Towards Modelica Models with Credibility Information&quot;, <em>Electronics</em>. 2022; 11(17):2728. <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a> </td> </tr> <tr> <td> [Gall2021] </td> <td> L. Gall, M. Otter, M. Reiner, M. Sch&auml;fer and J. Tobol&aacute;&rcaron;, &quot;Continuous Development and Management of Credible Modelica Models&quot;, <em>14th International Modelica Conference</em>, pp. 359&ndash;372, <a href="https://doi.org/10.3384/ecp21181359">doi 10.3384/ecp21181359</a>, 2021. </td> </tr> <tr> <td> [Riedmaier2021] </td> <td> S. Riedmaier, B. Danquah, B. Schick and F. Diermeyer, &quot;Unified Framework and Survey for Model Verification, Validation and Uncertainty Quantification&quot;, <em>Archives of Computational Methods in Engineering</em>, pp- 2655&ndash;2688, Springer, <a href="https://doi.org/10.1007/s11831-020-09473-7">doi 10.1007/s11831-020-09473-7</a>, 2021. </td> </tr> <tr> <td> [Bouskela2011] </td> <td> D. Bouskela, A. Jardin, Z. Benjelloun-Touimi, P. Aronsson and P. Fritzson, &quot;Modelling of Uncertainties with Modelica,&quot; <em>8th Modelica Conference</em>, pp. 673&ndash;685, <a href="https://doi.org/10.3384/ecp11063673">doi 10.3384/ecp11063673</a>, 2011. </td> </tr> </table> </html>
de: <html> <p> Folgende Bücher und Zeitungsartikel waren hilfreich für die Implementierung der Bibliothek. </p> <table border="0" cellspacing="0" cellpadding="2"> <!-- <tr> <td> [KeyYear] </td> <td> Author1 and Author2, &quot;Article title,&quot; <em>Journal</em>, information, year. </td> </tr> --> <tr> <td> [Otter2022] </td> <td> M. Otter, M. Reiner, J. Tobol&aacute;&rcaron;, L. Gall and M. Sch&auml;fer, &quot;Towards Modelica Models with Credibility Information&quot;, <em>Electronics</em>. 2022; 11(17):2728. <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a> </td> </tr> <tr> <td> [Gall2021] </td> <td> L. Gall, M. Otter, M. Reiner, M. Sch&auml;fer and J. Tobol&aacute;&rcaron;, &quot;Continuous Development and Management of Credible Modelica Models&quot;, <em>14th International Modelica Conference</em>, pp. 359&ndash;372, <a href="https://doi.org/10.3384/ecp21181359">doi 10.3384/ecp21181359</a>, 2021. </td> </tr> <tr> <td> [Riedmaier2021] </td> <td> S. Riedmaier, B. Danquah, B. Schick and F. Diermeyer, &quot;Unified Framework and Survey for Model Verification, Validation and Uncertainty Quantification&quot;, <em>Archives of Computational Methods in Engineering</em>, pp- 2655&ndash;2688, Springer, <a href="https://doi.org/10.1007/s11831-020-09473-7">doi 10.1007/s11831-020-09473-7</a>, 2021. </td> </tr> <tr> <td> [Bouskela2011] </td> <td> D. Bouskela, A. Jardin, Z. Benjelloun-Touimi, P. Aronsson and P. Fritzson, &quot;Modelling of Uncertainties with Modelica,&quot; <em>8th Modelica Conference</em>, pp. 673&ndash;685, <a href="https://doi.org/10.3384/ecp11063673">doi 10.3384/ecp11063673</a>, 2011. </td> </tr> </table> </html>

# Credibility.UsersGuide.Contact
source: Contact
de: Kontakt

# Credibility.UsersGuide.Contact
source: <html> <h4>Development</h4> <blockquote> Martin Otter (head of development)<br> Deutsches Zentrum f&uuml;r Luft- und Raumfahrt e.V. (DLR)<br> Institut f&uuml;r Systemdynamik und Regelungstechnik (SR)<br> M&uuml;nchener Stra&szlig;e 20<br> D-82234 We&szlig;ling<br> E-mail: <a href="mailto:sr-modelica@dlr.de">sr-modelica@dlr.de</a><br> Web: <a href="https://rmc.dlr.de/sr/de/staff/martin.otter/">rmc.dlr.de/sr/de/staff/Martin.Otter</a> </blockquote> <h4>Contributors</h4> <ul> <li>Matthias Reiner (DLR-SR)</li> <li>Jakub Tobolar (DLR-SR)</li> </ul> <h4>Acknowledgement</h4> <p> The development of the Library was organized within the European ITEA3 Call6 project <a href="https://www.upsim-project.eu">UPSIM</a> &ndash; Unleash Potentials in Simulation (number 19006). The work was partially funded by the German Federal Ministry of Education and Research (BMBF, grant numbers 01IS20072H and 01IS20072G). </p> <p> The development of this library is based on the work that was carried out by the library authors (see above) and by Leo Gall and Matthias Sch&auml;fer (both <a href="https://www.ltx.de">LTX Simulation GmbH</a>) in the UPSIM project, see journal article <em>Towards Modelica Models with Credibility Information</em>, <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a>. </p> <p> We would like to thank our colleague Andreas Pfeiffer (DLR-SR) for his idea about the convex combination approach used in <a href="modelica://Credibility.Table1D">Table1D</a> as well as for his contributions during discussion and realization of the model calibration of the simple drive line model. </p> </html>
de: <html> <h4>Entwicklung</h4> <blockquote> Martin Otter (Leiter der Entwicklung)<br> Deutsches Zentrum f&uuml;r Luft- und Raumfahrt e.V. (DLR)<br> Institut f&uuml;r Systemdynamik und Regelungstechnik (SR)<br> M&uuml;nchener Stra&szlig;e 20<br> D-82234 We&szlig;ling<br> E-Mail: <a href="mailto:sr-modelica@dlr.de">sr-modelica@dlr.de</a><br> Web: <a href="https://rmc.dlr.de/sr/de/staff/martin.otter/">rmc.dlr.de/sr/de/staff/Martin.Otter</a> </blockquote> <h4>Beitragende</h4> <ul> <li>Matthias Reiner (DLR-SR)</li> <li>Jakub Tobolar (DLR-SR)</li> </ul> <h4>Danksagung</h4> <p> Die Entwickung der Bibliothek wurde im Rahmen des europäischen ITEA3 Call6-Projekts <a href="https://www.upsim-project.eu">UPSIM</a> &ndash; Unleash Potentials in Simulation (Nummer 19006) organisiert. Die Arbeiten wurden teilfinanziert durch das Deutsche Bundesministerium für Bildung und Forschung (BMBF, Fördernummer 01IS20072H und 01IS20072G). </p> <p> Die Entwicklung dieser Bibliothek basiert auf den Arbeiten, die von den Autoren der Bibliothek (siehe oben) und von Leo Gall and Matthias Sch&auml;fer (beide <a href="https://www.ltx.de">LTX Simulation GmbH</a>) im UPSIM-Projekt durchgeführt wurden, siehe Zeitungsartikel <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a>. </p> <p> Wir möchten unserem Kollegen Andreas Pfeiffer (DLR-SR) für seine Idee zum in <a href="modelica://Credibility.Table1D">Table1D</a> verwendeten konvexen Kombinationsansatz sowie für seine Beiträge bei der Diskussion und Umsetzung der Modellkalibrierung des einfachen Antriebsstrangmodells danken. </p> </html>

# Credibility.UsersGuide.License
source: Copyright and License
de: Urheberrecht und Lizenzbestimmungen

# Credibility.Scalar
source: Record collecting credibility information for a scalar Real parameter
de: Record mit Information zur Glaubwürdigkeit von skalaren Parametern vom Typ Real

# Credibility.Scalar
source: Value of parameter
de: Parameterwert

# Credibility.Scalar
source: Traceability
de: Rückverfolgbarkeit

# Credibility.Scalar
source: Uncertainty
de: Unsicherheit

# Credibility.Scalar
source: Calibration setup
de: Kalibrierungseinstellung

# Credibility.Scalar
source: scalar
de: Skalar

# Credibility.Scalar
source: <html> <p> This record collects credibility information for a&nbsp;<em>scalar</em> parameter. In particular, it contains information regarding </p> <ul> <li> the Real value of the scalar parameter, </li> <li> traceability, </li> <li> uncertainty and </li> <li> calibration. </li> </ul> </html>
de: <html> <p> Dieses Record beinhaltet Informationen zur Glaubwürdigkeit eines <em>skalaren</em> Parameters, insbesondere Informationen bezüglich </p> <ul> <li> des Realwerts vom skalaren Parameter, </li> <li> der Verfolgbarkeit (traceability), </li> <li> der Unsicherheit (uncertainty) und </li> <li> der Kalibrierung. </li> </ul> </html>

# Credibility.Table1D
source: Record collecting credibility information for a Real 1D table
de: Record mit Information zur Glaubwürdigkeit von reelen 1D-Tabellen

# Credibility.Table1D
source: Scaled table
de: Skalierte Tabelle

# Credibility.Table1D
source: Traceability
de: Rückverfolgbarkeit

# Credibility.Table1D
source: Uncertainty
de: Unsicherheit

# Credibility.Table1D
source: URI of calibration setup script
de: URI vom Skript für Kalibrierungseinstellung

# Credibility.Table1D
source: table 1D
de: 1D-Tabelle

# Credibility.Table1D
source: <html> <p> This record collects credibility information for a&nbsp;<em>1d table</em> parameter. In particular, it contains information regarding </p> <ul> <li> the nominal values as [:,2] array (first column: abscissa, second column: ordinate values), see also <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a> &ndash; &quot;Array uncertainty&quot;. </li> <li> traceability, </li> <li> uncertainty and </li> <li> calibration. </li> </ul> </html>
de: <html> <p> Dieses Record beinhaltet Informationen zur Glaubwürdigkeit einer <em>1d-Tabelle</em>, insbesondere Informationen bezüglich </p> <ul> <li> Nominalwerte als [:,2] Datenfeld (erste Spalte: Abszisse, zweite Spalte: Ordinate), siehe auch <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a> &ndash; &quot;Unsicherheit von Datenfeldern&quot;. </li> <li> der Verfolgbarkeit (traceability), </li> <li> der Unsicherheit (uncertainty) und </li> <li> der Kalibrierung. </li> </ul> </html>

# Credibility.Examples
source: Collection of examples to demonstrate the usage of the library
de: Sammlung von Beispielen, die die Anwendung der Bibliothek aufzeigen

# Credibility.Examples
source: <html> <p> This package contains example models to demonstrate the usage of the Library. </p> </html>
de: <html> <p> Dieses Paket beinhaltet Modellbeispiele, die die Anwendung der Bibliothek aufzeigen. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear
source: Collection of examples involving simple drive train
de: Sammlung von Beispielen, die einen einfachen Antriebstrang betreffen

# Credibility.Examples.SimpleControlledDriveNonlinear
source: <html> <p> This package contains an example of a&nbsp;simple 1-dim. drive train and all classes demonstrating a&nbsp;possible usage of parameter credibility information within the context of this drive train. Most important: </p> <p> <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive">PartialDrive</a> is a&nbsp;partial model of a&nbsp;drive train with credibility information. The structure can be seen in the following image (from [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/CredibilityLibrary1.png" alt="A screenshot of Modelica library Credibility together with parametrization of a drive train example"> </div> <p> <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a> uses the partial model of the drive train, adds a&nbsp;controller and concrete values including credibility information by replacing the <em>PartialData</em> record with <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001">DataVariant001</a>. In particular nominal, upper/lower limit values for the table of the gear compliance are provided (image from [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/CredibilityLibrary2.png" alt="A screenshot of component Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original"> </div> </html>
de: <html> <p> Dieses Paket beinhaltet ein Beispiel eines einfachen Antriebstrang sowie alle Klassen, die zur Veranschaulichung einer möglichen Anwendung von Information der Parameterglaubwürdigkeit bei einem solchen Antriebstrang benötigt werden. Die wichtigsten sind: </p> <p> <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive">PartialDrive</a> ist ein Teilmodell des Antriebstrangs samt Informationen zur Glaubwürdigkeit. Die Struktur ist im folgenden Bild dargestellt (aus [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/CredibilityLibrary1.png" alt="Ein Bildschirmabzug der Modelica-Biblitohek Credibility zusammen mit Parametrierung des Antriebstrangs aus dem Beispiel"> </div> <p> <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">SimpleControlledDrive_original</a> verwendes das Teilmodell des Antriebstrangs und fügt einen Controller hinzu. Außerdem sind konkrete Werte einschließlich Informationen zur Glaubwürdigkeit durch das Ersetzen des Records <em>PartialData</em> durch <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001">DataVariant001</a>. eingesetzt. Insbesondere sind die Nominalwerte und die Unter- und Obergrenze der Tabelle für Getriebenachgiebigkeit vorhanden (Bild aus [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/CredibilityLibrary2.png" alt="Ein Bildschirmabzug der Komponente Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original"> </div> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Base record of credible parameters of simple control drive
de: Basis-Record von glaubwürdigen Parametern eines einfachen Antriebstrangs

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Name of identification variant
de: Name der Identifikationsvariante

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Inertia of load
de: Trägheit der Last

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Inertia of drive
de: Trägheit des Antriebs

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Gearbox transmission ratio (flange_a.phi/flange_b.phi)
de: Übersetzungsverhältnis des Getriebes

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Damper constant of drive compliance
de: Dämpferkonstante der Antriebsnachgiebigkeit

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: Table for nonlinear spring stiffness in N.m/rad of drive compliance
de: Tabelle der nichtlinearen Federsteifigkeit (in N.m/rad) der Antriebsnachgiebigkeit

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialData
source: <html> <p> A&nbsp;partial record containing all credible parameters needed for a&nbsp;<a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive">simple drive</a>. The parameters have only dummy values. A&nbsp;particular parameterization shall be done in a&nbsp;record which extends this one, see e.g. <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001">DataVariant001</a>. </p> </html>
de: <html> <p> Ein Teil-Record mit allen glaubwürdigen Parametern, die für einen <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive">einfachen Antriebstrang</a> benötigt werden. Die Parameter haben nur Blindwerte. Eine konkrete Parametrierung soll in einem Record vorgenommen werden, der von diesem Teil-Record vererbt, siehe z.B. <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001">DataVariant001</a>. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001
source: Data set of model variant 001
de: Datensatz der Modellvariante 001

# Credibility.Examples.SimpleControlledDriveNonlinear.DataVariant001
source: <html> <p> A&nbsp;record containing particular values and information of all credible parameters of the <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">simple controlled drive example</a>. </p> </html>
de: <html> <p> Ein Record mit konkreten Werten und Informationen von allen glaubwürdigen Parametern für ein <a href="modelica://Credibility.Examples.SimpleControlledDriveNonlinear.SimpleControlledDrive_original">Beispiel vom einfachen geregelten Antriebstrang</a>. </p> </html>

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: Not calibrated drive model with nonlinear compliance
de: Nicht kalibrierter Antriebsmodell mit nichtlinearer Nachgiebigkeit

# Credibility.Examples.SimpleControlledDriveNonlinear.PartialDrive
source: Data of the drive train, including credibility information
de: Daten vom Antriebstrang, mit Glaubwürdigkeitsinformation
