Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility
source: <html> <p> Package <strong>Credibility</strong> is a&nbsp;free Modelica package to add traceability, uncertainty and calibration information to parameters in a standardized way. For details, see </p> <ul> <li><a href="modelica://Credibility.Examples">Examples</a>, </li> <li><a href="modelica://Credibility.UsersGuide">User&apos;s Guide</a>, and the article </li> <li> M. Otter, M. Reiner, J. Tobol&aacute;&rcaron;, L. Gall and M. Sch&auml;fer, &quot;Towards Modelica Models with Credibility Information&quot;, <em>MDPI Electronics</em>. 2022; 11(17):2728,. <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a> </li> </ul> <p> For copyright and BSD 3-clause license, see <a href="modelica://Credibility.UsersGuide.License">Copyright and License agreement</a>. </p> </html>
de: <html> <p> Bibliothek <strong>Credibility</strong> ist eine freie Modelica-Bibliothek, die es ermöglicht, Modellparametern Informationen zur Rückverfolgbarkeit, Für Einzelheiten siehe </p> <ul> <li><a href="modelica://Credibility.Examples">Beispiele</a>,</li> <li><a href="modelica://Credibility.UsersGuide">Benutzerhandbuch</a>, und das Paper</li> <li> M. Otter, M. Reiner, J. Tobol&aacute;&rcaron;, L. Gall and M. Sch&auml;fer, &quot;Towards Modelica Models with Credibility Information&quot;, <em>MDPI Electronics</em>. 2022; 11(17):2728,. <a href="https://doi.org/10.3390/electronics11172728">doi 10.3390/electronics11172728</a> </li> </ul> <p> Für Urheberrecht und BSD 3-clause-Lizenz siehe <a href="modelica://Credibility.UsersGuide.License">Urheberrecht und Lizenzbestimmungen</a>. </p> </html>

# Credibility.UsersGuide
source: User's Guide
de: Benutzerhandbuch

# Credibility.UsersGuide
source: <html> <p> This is a&nbsp;short user&apos;s guide for the overall library. </p> </html>
de: <html> <p> Kurzes Benutzerhandbuch der Bibliothek. </p> </html>

# Credibility.UsersGuide.ParameterCredibility
source: Parameter credibility
de: Glaubwürdigkeit vom Parameter

# Credibility.UsersGuide.ParameterCredibility
source: <html> <p> For a&nbsp;credible model it is not sufficient to store only information about the whole model, e.g. using metadata, but also a&nbsp;documentation of each parameter, including credibility information, should be available. In this library, it is introduced such type of credibility information for model parameters. According to implemented approach, each parameter of a&nbsp;Modelica model does not only define a&nbsp;scalar or an array value, but the <em>parameter value</em> and additional information concerning <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">traceability</a>, <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">uncertainty</a> and <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">calibration</a> are stored in a&nbsp;record data structure. An example for a compliance spring constant is given in the next figure (from [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/SpringConstantCredibility.png" alt="Credibility attributes of spring constant c"> </div> </html>
de: <html> <p> Für ein glaubwürdiges Modell reicht es nicht aus, nur Informationen über das gesamte Modell zu speichern, z.B. mit Hilfe von Metadaten, sondern es sollte auch eine Dokumentation jedes einzelnen Parameters, einschließlich Glaubwürdigkeitsinformationen, verfügbar sein. In dieser Bibliothek wird eine solche Art von Glaubwürdigkeitsinformationen für Modellparameter eingeführt. Gemäß dem hier implementierten Ansatz definiert jeder Parameter eines Modelica-Modells nicht nur einen Skalar- oder Arraywert, sondern es werden der <em>Parameterwert</em> und zusätzliche Informationen über <a href="modelica://Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo">Rückverfolgbarkeit (traceability)</a>, <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Unsicherheit (uncertainty)</a> und <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">Kalibrierung (calibration)</a> in einer Record-Datenstruktur gespeichert. Ein Beispiel für eine Federkonstante (compliance spring constant) ist in der folgenden Abbildung dargestellt (aus [<a href="modelica://Credibility.UsersGuide.References">Otter2022</a>]): </p> <div> <img src="modelica://Credibility/Resources/Images/SpringConstantCredibility.png" alt="Glaubwürdigkeitsattribute der Federkonstante c"> </div> </html>

# Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo
source: Traceability information
de: Information zur Rückverfolgbarkeit

# Credibility.UsersGuide.ParameterCredibility.TraceabilityInfo
source: <html> <p> The aim of <em>traceability</em> is that anyone working with the model knows at any time why a&nbsp;parameter has a&nbsp;specific value. This is defined in the library with the three keys: </p> <ul> <li> <strong>source</strong>: origin of the parameter value (e.g. <em>Estimated</em>), see below. </li> <li> <strong>info</strong> (optional): a&nbsp;short textual explanation how the value was determined. </li> <li> <strong>reference</strong> (optional): identifies the resource where the determination of the value is described, for example web-address, DOI, ISBN, internal report ID of a&nbsp;document, data-sheet etc. The referenced resource must be stored in a&nbsp;way that avoids accidental manipulation, e.g., in a&nbsp;version control system with a&nbsp;given hash, in order to retain the reference information reliably. </li> </ul> <h4>Source</h4> <p> It is the way, how the value of the parameter was determined, and is realized as an enumeration <a href="modelica://Credibility.Types.SourceType">SourceType</a> that can take one of the following values. </p> <ul> <li> <strong>Unknown</strong>: the source of the value is not known. Such parameters have to be handled with care and are not sufficient for the demand of a&nbsp;good traceability </li> <li> <strong>Estimated</strong>: value from an educated guess, previous projects, extrapolated value, etc. </li> <li> <strong>Provided</strong>: value from a&nbsp;data sheet, supplier specification, etc. The <em>reference</em> (see above) to this source shall be also provided. </li> <li> <strong>Computed</strong>: value from computer aided data such as CAD, CFD, FEM, etc. The <em>reference</em> (see above) to this source shall be also provided. </li> <li> <strong>Measured</strong>: measured value from physical measurements. The <em>reference</em> (see above) to this source shall be also provided. </li> <li> <strong>Calibrated</strong>: value from a&nbsp;model calibration (based on provided data). The setup of the calibration &ndash; this means all information needed to repeat exactly this calibration &ndash; and the allowed parameter range should be stored in the calibration section of the parameter record, see <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">calibration information</a>. </li> </ul> </html>
de: <html> <p> Der Zweck von <em>Rückverfolgbarkeit (traceability)</em> ist, dass jede Person, die mit dem Modell arbeitet, zu jeder Zeit weiß, warum ein Parameter einen spezifischen Wert hat. Das ist in der Bibliothek mit drei Schlüßelwörtern definiert </p> <ul> <li> <em>Geschätzt (Estimated)</em>), siehe weiter unten. </li> <li> <strong>info</strong> (optional): kurze textuelle Beschreibung, wie der Wert ermittelt wurde </li> <li> <strong>reference</strong> (optional): identifiziert die Quelle, in der der Parameterwert beschrieben wird, z.B. Web-Adresse, DOI, ISBN, ID-Nummer eines internen Berichts, Datenblatts usw. Die referenzierte Ressource muss auf eine Art und Weise gespeichert werden, die eine versehentliche Manipulation verhindert, z.B. in einem Versionskontrollsystem mit einem vorgegebenen Hashwert, damit die Referenzinformationen zuverlässig erhalten bleiben. </li> </ul> <h4>Parameterquelle (source)</h4> <p> Es ist die Art und Weise, wie der Parameterwert bestimmt wurde, und ist realisiert als Aufzählung (enumeration) <a href="modelica://Credibility.Types.SourceType">SourceType</a>, das einen der folgenden Werte haben kann. </p> <ul> <li> <strong>Unknown</strong>: die Quelle des Parameterwertes ist unbekannt. Solche Parameter sollen mit Vorsicht behandelt werden und sind für die Zwecke einer guten Rückverfolgbarkeit nicht geeignet. </li> <li> <strong>Estimated</strong>: Wert aus einer qualifizierten Schätzung, einem Vorgängerprojekt, einer Wert-Extrapolation, usw. </li> <li> <strong>Provided</strong>: Wert aus einem Datenblatt, einer Herstellerspezifikation, usw. Die <em>Referenz</em> (siehe <strong>reference</strong> oben) zu dieser Quelle sollte ebenfalls angegeben werden. </li> <li> <strong>Computed</strong>: Wert aus computergestützten Daten wie CAD, CFD, FEM, usw. Die <em>Referenz</em> (siehe <strong>reference</strong> oben) zu dieser Quelle sollte ebenfalls angegeben werden. </li> <li> <strong>Measured</strong>: Messwert aus einer physikalischen Messung. Die <em>Referenz</em> (siehe <strong>reference</strong> oben) zu dieser Quelle sollte ebenfalls angegeben werden. </li> <li> <strong>Calibrated</strong>: Wert aus der Modellkalibrierung (basiert auf gegebenen Daten). Die Kalibrierungseinstellung &ndash; d.h. alle für Wiederholung von genau dieser Kalibrierung notwendigen Informationen &ndash; und die erlaubte Parameterbandbreite sollen im Kalibrierungsteil vom <a href="modelica://Credibility.UsersGuide.ParameterCredibility.CalibrationInfo">Information zur Kalibrierung</a>. </li> </ul> </html>

# Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo
source: Uncertainty information
de: Information zur Unsicherheit
