Repository: DLR-SR/Credibility
Catalog: Credibility/Resources/Language/Credibility.*.po
Languages: de

# Credibility.Utilities.Table1DScalings.getTableLambdaByInterval
source: <html> <p> Evaluate <code>table</code> from the <code>uncertainty</code> matrix by a&nbsp;convex combination utilizing attribute <code>lambda</code>. Hereby, the matrix <code>uncertainty</code> contains </p> <ul> <li> col. 1: grid values, </li> <li> col. 2: vector of <em>nominal values</em>, </li> <li> col. 3: vector of <em>lower</em> limits and </li> <li> col. 4: vector of <em>upper</em> limits. </li> </ul> <p> The convex combination is defined for the Real <code>lambda</code> in a&nbsp;way that </p> <ul> <li> <var>&lambda;</var> = &minus;1 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;3]</code>, </li> <li> <var>&lambda;</var> = 0 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2]</code> and </li> <li> <var>&lambda;</var> = 1 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;4]</code>. </li> </ul> <p> This function is called in <a href="modelica://Credibility.Table1D">Table1D</a> to evaluate &quot;table[i,j]&quot;. For further details, refer to <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a> &ndash; &quot;Convex scaling by uncertain parameter <var>&lambda;</var>&quot;. </p> </html>
de: <html> <p> Evaluiere <code>table</code> aus der <code>uncertainty</code>-Matrix mithilfe einer konvexen Kombination unter Verwendung des Attributes <code>lambda</code>. Hierbei beinhaltet die Matrix <code>uncertainty</code> </p> <ul> <li> Spalte 1: Rasterwerte, </li> <li> Spalte 2: Vektor der <em>Sollwerte</em>, </li> <li> Spalte 3: Vektor der <em>Untergrenzen</em> und </li> <li> Spalte 4: Vektor der <em>Obergrenzen</em>. </li> </ul> <p> Die konvexe Kombination ist definiert für die reele <code>lambda</code> so, dass </p> <ul> <li> <var>&lambda;</var> = &minus;1 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;3]</code>, </li> <li> <var>&lambda;</var> = 0 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2]</code> and </li> <li> <var>&lambda;</var> = 1 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;4]</code>. </li> </ul> <p> Diese Funktion is aufgerufen in <a href="modelica://Credibility.Table1D">Table1D</a>, um &quot;table[i,j]&quot; auszuwerten. Für weitere Einzelheiten siehe <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a> &ndash; &quot;Konvexe Skalierung mit unsicherem Parameter&nbsp;<var>&lambda;</var>&quot;. </p> </html>

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: Calculate scaled table by tolerances
de: Berechne skalierte Tabelle mithilfe Toleranzen

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: Convex scaling between -1 and 1 (=0: nominal)
de: Konvexe Skalierung zwischen -1 und 1 (=0: nominal)

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: Table uncertainty (x, nominal)
de: Unsicherheit der Tabelle (x, nominal)

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: Limits: |value[i] - uncertainty[i,2]| <= max(absTol,relTol*|uncertainty[i,2]|)
de: Grenzwerte: |value[i] - uncertainty[i,2]| <= max(absTol, relTol*|uncertainty[i,2]|)

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: Value of table
de: Tabellenwerte

# Credibility.Utilities.Table1DScalings.getTableLambdaByTolerance
source: <html> <p> Evaluate <code>table</code> from the <code>uncertainty</code> matrix and <strong>tolerances</strong> by a&nbsp;convex combination utilizing attribute <code>lambda</code>. Hereby, the matrix <code>uncertainty</code> contains </p> <ul> <li> col. 1: grid values, </li> <li> col. 2: vector of <em>nominal values</em>. </li> </ul> <p> The convex combination is defined for the Real <code>lambda</code> in a&nbsp;way that </p> <ul> <li> <var>&lambda;</var> = &minus;1 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2] - tol[:]</code>, </li> <li> <var>&lambda;</var> = 0 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2]</code> and </li> <li> <var>&lambda;</var> = 1 results in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2] + tol[:]</code>. </li> </ul> <p> The tolerance vector <code>tol</code> is defined element-wise by </p> <blockquote><pre> tol[i] = max( absTol, relTol*abs(uncertainty[i, 2]) ). </pre></blockquote> <p> This function is called in <a href="modelica://Credibility.Table1D">Table1D</a> to evaluate &quot;table[i,j]&quot;. For further details, refer to <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">User&apos;s Guide</a> &ndash; &quot;Convex scaling by uncertain parameter <var>&lambda;</var>&quot;. </p> </html>
de: <html> <p> Evaluiere <code>table</code> aus der <code>uncertainty</code>-Matrix und <strong>Toleranzen</strong> mithilfe einer konvexen Kombination unter Verwendung des Attributes <code>lambda</code>. Hierbei beinhaltet die Matrix <code>uncertainty</code> </p> <ul> <li> Spalte 1: Rasterwerte, </li> <li> Spalte 2: Vektor der <em>Sollwerte</em>. </li> </ul> <p> Die konvexe Kombination ist definiert für die reele <code>lambda</code> so, dass </p> <ul> <li> <var>&lambda;</var> = &minus;1 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2] - tol[:]</code>, </li> <li> <var>&lambda;</var> = 0 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2]</code> and </li> <li> <var>&lambda;</var> = 1 resultiert in <code>table[:,&nbsp;2]</code>&nbsp;= <code>uncertainty[:,&nbsp;2] + tol[:]</code>. </li> </ul> <p> Der Toleranzvektor <code>tol</code> ist definiert elementweise durch </p> <blockquote><pre> tol[i] = max( absTol, relTol*abs(uncertainty[i, 2]) ). </pre></blockquote> <p> Diese Funktion is aufgerufen in <a href="modelica://Credibility.Table1D">Table1D</a>, um &quot;table[i,j]&quot; auszuwerten. Für weitere Einzelheiten siehe <a href="modelica://Credibility.UsersGuide.ParameterCredibility.UncertaintyInfo">Benutzerhandbuch</a> &ndash; &quot;Konvexe Skalierung mit unsicherem Parameter&nbsp;<var>&lambda;</var>&quot;. </p> </html>

# Credibility.Icons
source: Icons used in the library
de: Icons der Bibliothek

# Credibility.Icons
source: <html> <p> This package contains definitions for the graphical layout of components which may be used in different packages. The icons can be utilized by inheriting them in the desired class using &quot;extends&quot; or by directly copying the &quot;icon&quot; layer. </p> </html>
de: <html> <p> Dieses Paket enthält Definitionen für das grafische Layout von Komponenten, die in verschiedenen Paketen verwendet werden können. Die Icons können verwendet werden, indem sie in der gewünschten Klasse mit &quot;extends&quot; vererbt werden, oder aber es kann die &quot;icon&quot;-Ebene direkt dorthin kopiert werden. </p> </html>

# Credibility.Icons.CredibleBase
source: Basic icon for Credibility records
de: Basis-Icon für Glaubwürdigkeitsrecords

# Credibility.Icons.CredibleBase
source: <html> <p> This icon indicates a record being used to define credibility attributes. </p> </html>
de: <html> <p> Dieses Icon zeigt ein Record an, der zur Definition von Glaubwürdigkeitsattributen verwendet wird. </p> </html>

# Credibility.Icons.CredibleBase
source: credible
de: glaubwürdig

# Credibility.Tests
source: Tests the components of this library
de: Komponententests der Bibliothek

# Credibility.Tests
source: <html> <p> Package to test classes from across the Library. </p> </html>
de: <html> <p> Paket zum Testen von verschiedenen Klassen aus der ganzen Bibliothek. </p> </html>

# Credibility.Tests.TestRecords
source: Test of all records defined in the library
de: Test aller Records der Bibliothek

# Credibility.Tests.TestRecords
source: <html> <p> Test different variants of credibility records. </p> </html>
de: <html> <p> Test von verschiedenen Varianten des Glaubwürdigkeitsrecords, die in der Bibliothek definiert sind. </p> </html>
